[{"class": "bard", "name": "Blade Ward", "source": "Player's Handbook", "level": 0, "casting": "1 action", "range": "Self", "components": "V, S", "duration": "1 round", "description": "You extend your hand and trace a sigil of warding in the air. Until the end of your next turn, you have resistance against bludgeoning, piercing, and slashing damage dealt by weapon attacks."}, {"class": "bard", "name": "Dancing Lights", "source": "Player's Handbook", "level": 0, "casting": "1 action", "range": "120 feet", "components": "V, S, M (a bit of phosphorus or wychwood, or a glowworm)", "duration": "Concentration, up to 1 minute", "description": "You create up to four torch-sized lights within range, making them appear as torches, lanterns, or glowing orbs that hover in the air for the duration. You can also combine the four lights into one glowing vaguely humanoid form of Medium size. Whichever form you choose, each light sheds dim light in a 10-foot radius."}, {"class": "bard", "name": "Friends", "source": "Player's Handbook", "level": 0, "casting": "1 action", "range": "Self", "components": "S, M (a small amount of makeup applied to the face as this spell is cast)", "duration": "Concentration, up to 1 minute", "description": "For the duration, you have advantage on all Charisma checks directed at one creature of your choice that isn't hostile toward you. When the spell ends, the creature realizes that you used magic to influence its mood and becomes hostile toward you. A creature prone to violence might attack you. Another creature might seek retribution in other ways (at the DM's discretion), depending on the nature of your interaction with it."}, {"class": "bard", "name": "Light", "source": "Player's Handbook", "level": 0, "casting": "1 action", "range": "Touch", "components": "V, M (a firefly or phosphorescent moss)", "duration": "1 hour", "description": "You touch one object that is no larger than 10 feet in any dimension. Until the spell ends, the object sheds bright light in a 20-foot radius and dim light for an additional 20 feet. The light can be colored as you like. Completely covering the object with something opaque blocks the light. The spell ends if you cast it again or dismiss it as an action."}, {"class": "bard", "name": "Mage Hand", "source": "Player's Handbook", "level": 0, "casting": "1 action", "range": "30 feet", "components": "V, S", "duration": "1 minute", "description": "A spectral, floating hand appears at a point you choose within range. The hand lasts for the duration or until you dismiss it as an action. The hand vanishes if it is ever more than 30 feet away from you or if you cast this spell again."}, {"class": "bard", "name": "Mending", "source": "Player's Handbook", "level": 0, "casting": "1 minute", "range": "Touch", "components": "V, S, M (two lodestones)", "duration": "Instantaneous", "description": "This spell repairs a single break or tear in an object you touch, such as a broken chain link, two halves of a broken key, a torn cloak, or a leaking wineskin. As long as the break or tear is no larger than 1 foot in any dimension, you mend it, leaving no trace of the former damage."}, {"class": "bard", "name": "Message", "source": "Player's Handbook", "level": 0, "casting": "1 action", "range": "120 feet", "components": "V, S, M (a short piece of copper wire)", "duration": "1 round", "description": "You point your finger toward a creature within range and whisper a message. The target (and only the target) hears the message and can reply in a whisper that only you can hear."}, {"class": "bard", "name": "Minor Illusion", "source": "Player's Handbook", "level": 0, "casting": "1 action", "range": "30 feet", "components": "S, M (a bit of fleece)", "duration": "1 minute", "description": "You create a sound or an image of an object within range that lasts for the duration. The illusion also ends if you dismiss it as an action or cast this spell again."}, {"class": "bard", "name": "Prestidigitation", "source": "Player's Handbook", "level": 0, "casting": "1 action", "range": "10 feet", "components": "V, S", "duration": "Up to 1 hour", "description": "This spell is a minor magical trick that novice spellcasters use for practice. You create one of the following magical effects within range:"}, {"class": "bard", "name": "Thunderclap", "source": "Xanathar's Guide to Everything", "level": 0, "casting": "1 action", "range": "Self (5-foot radius)", "components": "S", "duration": "Instantaneous", "description": "You create a burst of thunderous sound, which can be heard 100 feet away. Each creature other than you within 5 feet of you must make a Constitution saving throw. On a failed save, the creature takes 1d6 thunder damage."}, {"class": "bard", "name": "True Strike", "source": "Player's Handbook", "level": 0, "casting": "1 action", "range": "30 feet", "components": "S", "duration": "Concentration, up to 1 round", "description": "You extend your hand and point a finger at a target in range. Your magic grants you a brief insight into the target’s defenses. On your next turn, you gain advantage on your first attack roll against the target, provided that this spell hasn’t ended."}, {"class": "bard", "name": "Vicious Mockery", "source": "Player's Handbook", "level": 0, "casting": "1 action", "range": "60 feet", "components": "V", "duration": "Instantaneous", "description": "You unleash a string of insults laced with subtle enchantments at a creature you can see within range. If the target can hear you (though it need not understand you), it must succeed on a Wisdom saving throw or take 1d4 psychic damage and have disadvantage on the next attack roll it makes before the end of its next turn."}, {"class": "bard", "name": "Animal Friendship", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "30 feet", "components": "V, S, M (a morsel of food)", "duration": "24 hours", "description": "This spell lets you convince a beast that you mean it no harm. Choose a beast that you can see within range. It must see and hear you. If the beast’s Intelligence is 4 or higher, the spell fails. Otherwise, the beast must succeed on a Wisdom saving throw or be charmed by you for the spell’s duration. If you or one of your companions harms the target, the spell ends."}, {"class": "bard", "name": "Bane", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "30 feet", "components": "V, S, M (a drop of blood)", "duration": "Concentration, up to 1 minute", "description": "Up to three creatures of your choice that you can see within range must make Charisma saving throws. Whenever a target that fails this saving throw makes an attack roll or a saving throw before the spell ends, the target must roll a d4 and subtract the number rolled from the attack roll or saving throw."}, {"class": "bard", "name": "Charm Person", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "30 feet", "components": "V, S", "duration": "1 hour", "description": "You attempt to charm a humanoid you can see within range. It must make a Wisdom saving throw, and does so with advantage if you or your companions are fighting it. If it fails the saving throw, it is charmed by you until the spell ends or until you or your companions do anything harmful to it. The charmed creature regards you as a friendly acquaintance. When the spell ends, the creature knows it was charmed by you."}, {"class": "bard", "name": "Color Spray", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "Self (15-foot cone)", "components": "V, S, M", "duration": "1 round", "description": "A dazzling array of flashing, colored light springs from your hand. Roll 6d10, the total is how many hit points of creatures this spell can effect. Creatures in a 15-foot cone originating from you are affected in ascending order of their current hit points (ignoring unconscious creatures and creatures that can’t see)."}, {"class": "bard", "name": "Command", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "60 feet", "components": "V", "duration": "1 round", "description": "You speak a one-word command to a creature you can see within range. The target must succeed on a Wisdom saving throw or follow the command on its next turn. The spell has no effect if the target is undead, if it doesn’t understand your language, or if your command is directly harmful to it. Some typical commands and their effects follow. You might issue a command other than one described here. If you do so, the DM determines how the target behaves. If the target can’t follow your command, the spell ends."}, {"class": "bard", "name": "Comprehend Languages", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "Self", "components": "V, S, M (a pinch of soot and salt)", "duration": "1 hour", "description": "For the duration, you understand the literal meaning of any spoken language that you hear. You also understand any written language that you see, but you must be touching the surface on which the words are written. It takes about 1 minute to read one page of text."}, {"class": "bard", "name": "Cure Wounds", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "Touch", "components": "V, S", "duration": "Instantaneous", "description": "A creature you touch regains a number of hit points equal to 1d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs."}, {"class": "bard", "name": "Detect Magic", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "Self", "components": "V, S", "duration": "Concentration, up to 10 minutes", "description": "For the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any."}, {"class": "bard", "name": "Disguise Self", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "Self", "components": "V, S", "duration": "1 hour", "description": "You make yourself – including your clothing, armor, weapons, and other belongings on your person – look different until the spell ends or until you use your action to dismiss it. You can seem 1 foot shorter or taller and can appear thin, fat, or in between. You can’t change your body type, so you must adopt a form that has the same basic arrangement of limbs. Otherwise, the extent of the illusion is up to you."}, {"class": "bard", "name": "Dissonant Whispers", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "60 feet", "components": "V", "duration": "Instantaneous", "description": "You whisper a discordant melody that only one creature of your choice within range can hear, wracking it with terrible pain. The target must make a Wisdom saving throw. On a failed save, it takes 3d6 psychic damage and must immediately use its reaction, if available, to move as far as its speed allows away from you. The creature doesn’t move into obviously dangerous ground, such as a fire or a pit. On a successful save, the target takes half as much damage and doesn’t have to move away. A deafened creature automatically succeeds on the save."}, {"class": "bard", "name": "Distort Value", "source": "Acquisitions Inc.", "level": 1, "casting": "1 minute", "range": "Touch", "components": "V", "duration": "8 hours", "description": "You cast this spell on an object no more than 1 foot on a side, doubling the object's perceived value by adding illusionary flourish or reducing its perceived value by half with the help of illusionary dents and scratches. Anyone examining the object must roll an Investigation check against your spell DC."}, {"class": "bard", "name": "Earth Tremor", "source": "Xanathar's Guide to Everything/Elemental Evil Player's Companion", "level": 1, "casting": "1 action", "range": "Self (10-foot radius)", "components": "V, S", "duration": "Instantaneous", "description": "You cause a tremor in the ground in a 10-foot radius. Each creature other than you in that area must make a Dexterity saving throw. On a failed save, a creature takes 1d6 bludgeoning damage and is knocked prone. If the ground in that area is loose earth or stone, it becomes difficult terrain until cleared."}, {"class": "bard", "name": "Faerie Fire", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "60 feet", "components": "V", "duration": "Concentration, up to 1 minute", "description": "Each object in a 20-foot cube within range is outlined in blue, green, or violet light (your choice)."}, {"class": "bard", "name": "Feather Fall", "source": "Player's Handbook", "level": 1, "casting": "1 reaction, which you take when you or a creature within 60 feet of you falls", "range": "60 feet", "components": "V, M (a small feather or piece of down)", "duration": "1 minute", "description": "Choose up to five falling creatures within range. A falling creature’s rate of descent slows to 60 feet per round until the spell ends. If the creature lands before the spell ends, it takes no falling damage and can land on its feet, and the spell ends for that creature."}, {"class": "bard", "name": "Healing Word", "source": "Player's Handbook", "level": 1, "casting": "1 bonus action", "range": "60 feet", "components": "V", "duration": "Instantaneous", "description": "A creature of your choice that you can see within range regains hit points equal to 1d4 + your spellcasting ability modifier. This spell has no effect on undead or constructs."}, {"class": "bard", "name": "Heroism", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "Touch", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "A willing creature you touch is imbued with bravery. Until the spell ends, the creature is immune to being frightened and gains temporary hit points equal to your spellcasting ability modifier at the start of each of its turns. When the spell ends, the target loses any remaining temporary hit points from this spell."}, {"class": "bard", "name": "Identify", "source": "Player's Handbook", "level": 1, "casting": "1 minute", "range": "Touch", "components": "V, S, M (a pearl worth at least 100 gp and an owl feather)", "duration": "Instantaneous", "description": "You choose one object that you must touch throughout the casting of the spell. If it is a magic item or some other magic-imbued object, you learn its properties and how to use them, whether it requires attunement to use, and how many charges it has, if any. You learn whether any spells are affecting the item and what they are. If the item was created by a spell, you learn which spell created it."}, {"class": "bard", "name": "Illusory Script", "source": "Player's Handbook", "level": 1, "casting": "1 minute", "range": "Touch", "components": "S, M (a lead-based ink worth at least 10 gp, which the spell consumes)", "duration": "10 days", "description": "You write on parchment, paper, or some other suitable writing material and imbue it with a potent illusion that lasts for the duration."}, {"class": "bard", "name": "Longstrider", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "Touch", "components": "V, S, M (a pinch of dirt)", "duration": "1 hour", "description": "You touch a creature. The target’s speed increases by 10 feet until the spell ends."}, {"class": "bard", "name": "Silent Image", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "60 feet", "components": "V, S, M (a bit of fleece)", "duration": "Concentration, up to 10 minutes", "description": "You create the image of an object, a creature, or some other visible phenomenon that is no larger than a 15-foot cube. The image appears at a spot within range and lasts for the duration. The image is purely visual; it isn’t accompanied by sound, smell, or other sensory effects."}, {"class": "bard", "name": "Silvery Barbs", "source": "Strixhaven", "level": 1, "casting": "1 reaction, which you take when a creature you can see within 60 feet of yourself succeeds on an attack roll, an ability check, or a saving throw", "range": "60 feet", "components": "V", "duration": "Instantaneous", "description": "You magically distract the triggering creature and turn its momentary uncertainty into encouragement for another creature. The triggering creature must reroll the d20 and use the lower roll."}, {"class": "bard", "name": "Sleep", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "90 feet", "components": "V, S, M (a pinch of fine sand, rose petals, or a cricket)", "duration": "1 minute", "description": "This spell sends creatures into a magical slumber. Roll 5d8, the total is how many hit points of creatures this spell can affect. Creatures within 20 feet of a point you choose within range are affected in ascending order of their current hit points (ignoring unconscious creatures)."}, {"class": "bard", "name": "Speak with Animals", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "Self", "components": "V, S", "duration": "10 minutes", "description": "You gain the ability to comprehend and verbally communicate with beasts for the duration. The knowledge and awareness of many beasts is limited by their intelligence, but at minimum, beasts can give you information about nearby locations and monsters, including whatever they can perceive or have perceived within the past day. You might be able to persuade a beast to perform a small favor for you, at the DM’s discretion."}, {"class": "bard", "name": "Tasha's Hideous Laughter", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "30 feet", "components": "V, S, M (tiny tarts and a feather that is waved in the air)", "duration": "Concentration, up to 1 minute", "description": "A creature of your choice that you can see within range perceives everything as hilariously funny and falls into fits of laughter if this spell affects it. The target must succeed on a Wisdom saving throw or fall prone, becoming incapacitated and unable to stand up for the duration. A creature with an Intelligence score of 4 or less isn’t affected."}, {"class": "bard", "name": "Thunderwave", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "Self (15-foot cube)", "components": "V, S", "duration": "Instantaneous", "description": "A wave of thunderous force sweeps out from you. Each creature in a 15-foot cube originating from you must make a Constitution saving throw. On a failed save, a creature takes 2d8 thunder damage and is pushed 10 feet away from you. On a successful save, the creature takes half as much damage and isn’t pushed."}, {"class": "bard", "name": "Unseen Servant", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "60 feet", "components": "V, S, M (a piece of string and a bit of wood)", "duration": "1 hour", "description": "This spell creates an invisible, mindless, shapeless, Medium force that performs simple tasks at your command until the spell ends. The servant springs into existence in an unoccupied space on the ground within range. It has AC 10, 1 hit point, and a Strength of 2, and it can’t attack. If it drops to 0 hit points, the spell ends."}, {"class": "bard", "name": "Aid", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "30 feet", "components": "V, S, M (a tiny strip of white cloth)", "duration": "8 hours", "description": "Your spell bolsters your allies with toughness and resolve. Choose up to three creatures within range. Each target’s hit point maximum and current hit points increase by 5 for the duration."}, {"class": "bard", "name": "Animal Messenger", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "30 feet", "components": "V, S, M (a morsel of food)", "duration": "24 hours", "description": "By means of this spell, you use an animal to deliver a message. Choose a Tiny beast you can see within range, such as a squirrel, a blue jay, or a bat. You specify a location, which you must have visited, and a recipient who matches a general description, such as “a man or woman dressed in the uniform of the town guard” or “a red-haired dwarf wearing a pointed hat.” You also speak a message of up to twenty-five words. The target beast travels for the duration of the spell toward the specified location, covering about 50 miles per 24 hours for a flying messenger, or 25 miles for other animals."}, {"class": "bard", "name": "Blindness/Deafness", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "30 feet", "components": "V", "duration": "1 minute", "description": "You can blind or deafen a foe. Choose one creature that you can see within range to make a Constitution saving throw. If it fails, the target is either blinded or deafened (your choice) for the duration. At the end of each of its turns, the target can make a Constitution saving throw. On a success, the spell ends."}, {"class": "bard", "name": "Borrowed Knowledge", "source": "Strixhaven", "level": 2, "casting": "1 action", "range": "Self", "components": "V, S, M (a book worth at least 25 gp)", "duration": "1 hour", "description": "You draw on knowledge from spirits of the past. Choose one skill in which you lack proficiency. For the spell's duration, you have proficiency in the chosen skill. The spell ends early if you cast it again."}, {"class": "bard", "name": "Calm Emotions", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "You attempt to suppress strong emotions in a group of people. Each humanoid in a 20-foot-radius sphere centered on a point you choose within range must make a Charisma saving throw; a creature can choose to fail this saving throw if it wishes. If a creature fails its saving throw, choose one of the following two effects. You can suppress any effect causing a target to be charmed or frightened. When this spell ends, any suppressed effect resumes, provided that its duration has not expired in the meantime."}, {"class": "bard", "name": "Cloud of Daggers", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "60 feet", "components": "V, S, M (a sliver of glass)", "duration": "Concentration, up to 1 minute", "description": "You fill the air with spinning daggers in a cube 5 feet on each side, centered on a point you choose within range. A creature takes 4d4 slashing damage when it enters the spell’s area for the first time on a turn or starts its turn there."}, {"class": "bard", "name": "Crown of Madness", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "120 feet", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "One humanoid of your choice that you can see within range must succeed on a Wisdom saving throw or become charmed by you for the duration. While the target is charmed in this way, a twisted crown of jagged iron appears on its head, and a madness glows in its eyes."}, {"class": "bard", "name": "Detect Thoughts", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "Self", "components": "V, S, M (a copper piece)", "duration": "Concentration, up to 1 minute", "description": "For the duration, you can read the thoughts of certain creatures. When you cast the spell and as your action on each turn until the spell ends, you can focus your mind on any one creature that you can see within 30 feet of you. If the creature you choose has an Intelligence of 3 or lower or doesn’t speak any language, the creature is unaffected."}, {"class": "bard", "name": "Enhance Ability", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "Touch", "components": "V, S, M (fur or a feather from a beast)", "duration": "Concentration, up to 1 hour", "description": "You touch a creature and bestow upon it a magical enhancement. Choose one of the following effects; the target gains the effect until the spell ends."}, {"class": "bard", "name": "Enlarge/Reduce", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "30 feet", "components": "V, S, M (a pinch of powdered iron)", "duration": "Concentration, up to 1 minute", "description": "You cause a creature or an object you can see within range to grow larger or smaller for the duration. Choose either a creature or an object that is neither worn nor carried. If the target is unwilling, it can make a Constitution saving throw. On a success, the spell has no effect."}, {"class": "bard", "name": "Enthrall", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "1 minute", "description": "You weave a distracting string of words, causing creatures of your choice that you can see within range and that can hear you to make a Wisdom saving throw. Any creature that can’t be charmed succeeds on this saving throw automatically, and if you or your companions are fighting a creature, it has advantage on the save. On a failed save, the target has disadvantage on Wisdom (Perception) checks made to perceive any creature other than you until the spell ends or until the target can no longer hear you. The spell ends if you are incapacitated or can no longer speak."}, {"class": "bard", "name": "Gift of Gab", "source": "Acquisitions Inc.", "level": 2, "casting": "1 reaction, which you take when you speak to another creature", "range": "Self", "components": "V, S, M (2 gold coins, which is consumed as tax for using the spell)", "duration": "Instantaneous", "description": "When you cast this spell, you skillfully reshape the memories of listeners in your immediate area, so that each creature of your choice within 5 feet of you forgets everything you said within the last 6 seconds. Those creatures then remember that you actually said the words you speak as the verbal component of the spell."}, {"class": "bard", "name": "Heat Metal", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "60 feet", "components": "V, S, M (a piece of iron and a flame)", "duration": "Concentration, up to 1 minute", "description": "Choose a manufactured metal object, such as a metal weapon or a suit of heavy or medium metal armor, that you can see within range. You cause the object to glow red-hot. Any creature in physical contact with the object takes 2d8 fire damage when you cast the spell. Until the spell ends, you can use a bonus action on each of your subsequent turns to cause this damage again."}, {"class": "bard", "name": "Hold Person", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "60 feet", "components": "V, S, M (a small, straight piece of iron)", "duration": "Concentration, up to 1 minute", "description": "Choose a humanoid that you can see within range. The target must succeed on a Wisdom saving throw or be paralyzed for the duration. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the spell ends on the target."}, {"class": "bard", "name": "Invisibility", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "Touch", "components": "V, S, M (an eyelash encased in gum arabic)", "duration": "Concentration, up to 1 hour", "description": "A creature you touch becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target’s person. The spell ends for a target that attacks or casts a spell."}, {"class": "bard", "name": "Kinetic Jaunt", "source": "Strixhaven", "level": 2, "casting": "1 bonus action", "range": "Self", "components": "S", "duration": "Concentration, up to 1 minute", "description": "You magically empower your movement with dancelike steps, giving yourself the following benefits for the duration:"}, {"class": "bard", "name": "Knock", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "60 feet", "components": "V", "duration": "Instantaneous", "description": "Choose an object that you can see within range. The object can be a door, a box, a chest, a set of manacles, a padlock, or another object that contains a mundane or magical means that prevents access."}, {"class": "bard", "name": "Lesser Restoration", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "Touch", "components": "V, S", "duration": "Instantaneous", "description": "You touch a creature and can end either one disease or one condition afflicting it. The condition can be blinded, deafened, paralyzed, or poisoned."}, {"class": "bard", "name": "Locate Animals or Plants", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "Self", "components": "V, S, M (a bit of fur from a bloodhound)", "duration": "Instantaneous", "description": "Describe or name a specific kind of beast or plant. Concentrating on the voice of nature in your surroundings, you learn the direction and distance to the closest creature or plant of that kind within 5 miles, if any are present."}, {"class": "bard", "name": "Locate Object", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "Self", "components": "V, S, M (a forked twig)", "duration": "Concentration, up to 10 minutes", "description": "Describe or name an object that is familiar to you. You sense the direction to the object’s location, as long as that object is within 1,000 feet of you. If the object is in motion, you know the direction of its movement."}, {"class": "bard", "name": "Magic Mouth", "source": "Player's Handbook", "level": 2, "casting": "1 minute", "range": "30 feet", "components": "V, S, M (a small bit of honeycomb and jade dust worth at least 10 gp, which the spell consumes)", "duration": "Until dispelled", "description": "You implant a message within an object in range, a message that is uttered when a trigger condition is met. Choose an object that you can see and that isn’t being worn or carried by another creature. Then speak the message, which must be 25 words or less, though it can be delivered over as long as 10 minutes. Finally, determine the circumstance that will trigger the spell to deliver your message."}, {"class": "bard", "name": "Mirror Image", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "Self", "components": "V, S", "duration": "1 minute", "description": "Three illusory duplicates of yourself appear in your space. Until the spell ends, the duplicates move with you and mimic your actions, shifting position so it’s impossible to track which image is real. You can use your action to dismiss the illusory duplicates."}, {"class": "bard", "name": "Nathair's Mischief", "source": "Fizban's Treasury of Dragons", "level": 2, "casting": "1 Action", "range": "60ft", "components": "S, M (a piece of crust from an apple pie)", "duration": "Concentration, up to 1 minute", "description": "You fill a 20-foot cube you can see within range with fey and draconic magic. Roll on the Mischievous Surge table to determine the magical effect produced, and roll again at the start of each of your turns until the spell ends. You can move the cube up to 10 feet before you roll."}, {"class": "bard", "name": "Phantasmal Force", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "60 feet", "components": "V, S, M (a bit of fleece)", "duration": "Concentration, up to 1 minute", "description": "You craft an illusion that takes root in the mind of a creature that you can see within range. The target must make an Intelligence saving throw. On a failed save, you create a phantasmal object, creature, or other visible phenomenon of your choice that is no larger than a 10-foot cube and that is perceivable only to the target for the duration. This spell has no effect on undead or constructs."}, {"class": "bard", "name": "Pyrotechnics", "source": "Xanathar's Guide to Everything", "level": 2, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "Instantaneous", "description": "Choose an area of flame that you can see and that can fit within a 5-foot cube within range. You can extinguish the fire in that area, and you create either fireworks or smoke."}, {"class": "bard", "name": "See Invisibility", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "Self", "components": "V, S, M (a pinch of talc and a small sprinkling of powdered silver)", "duration": "1 hour", "description": "For the duration, you see invisible creatures and objects as if they were visible, and you can see into the Ethereal Plane. Ethereal creatures and objects appear ghostly and translucent."}, {"class": "bard", "name": "Shatter", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "60 feet", "components": "V, S, M (a chip of mica)", "duration": "Instantaneous", "description": "A sudden loud ringing noise, painfully intense, erupts from a point of your choice within range. Each creature in a 10-foot-radius sphere centered on that point must make a Constitution saving throw. A creature takes 3d8 thunder damage on a failed save, or half as much damage on a successful one. A creature made of inorganic material such as stone, crystal, or metal has disadvantage on this saving throw."}, {"class": "bard", "name": "Silence", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "120 feet", "components": "V, S", "duration": "Concentration, up to 10 minutes", "description": "For the duration, no sound can be created within or pass through a 20-foot-radius sphere centered on a point you choose within range. Any creature or object entirely inside the sphere is immune to thunder damage, and creatures are deafened while entirely inside it. Casting a spell that includes a verbal component is impossible there."}, {"class": "bard", "name": "Skywrite", "source": "Xanathar's Guide to Everything", "level": 2, "casting": "1 action", "range": "Sight", "components": "V, S", "duration": "Concentration, up to 1 day", "description": "You cause up to ten words to form in a part of the sky you can see. The words appear to be made of cloud and remain in place for the spell’s duration. The words dissipate when the spell ends. A strong wind can disperse the clouds and end the spell early."}, {"class": "bard", "name": "Suggestion", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "30 feet", "components": "V, M (a snake’s tongue and either a bit of honeycomb or a drop of sweet oil)", "duration": "Concentration, up to 8 hours", "description": "You suggest a course of activity (limited to a sentence or two) and magically influence a creature you can see within range that can hear and understand you. Creatures that can’t be charmed are immune to this effect. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to stab itself, throw itself onto a spear, immolate itself, or do some other obviously harmful act ends the spell."}, {"class": "bard", "name": "Warding Wind", "source": "Xanathar's Guide to Everything", "level": 2, "casting": "1 action", "range": "Self", "components": "V", "duration": "Concentration, up to 10 minutes", "description": "A strong wind (20 miles per hour) blows around you in a 10-foot radius and moves with you, remaining centered on you. The wind lasts for the spell’s duration."}, {"class": "bard", "name": "Zone of Truth", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "10 minutes", "description": "You create a magical zone that guards against deception in a 15-foot-radius sphere centered on a point of your choice within range. Until the spell ends, a creature that enters the spell’s area for the first time on a turn or starts its turn there must make a Charisma saving throw. On a failed save, a creature can’t speak a deliberate lie while in the radius. You know whether each creature succeeds or fails on its saving throw."}, {"class": "bard", "name": "Bestow Curse", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "Touch", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "You touch a creature, and that creature must succeed on a Wisdom saving throw or become cursed for the duration of the spell. When you cast this spell, choose the nature of the curse from the following options:"}, {"class": "bard", "name": "Catnap", "source": "Xanathar's Guide to Everything", "level": 3, "casting": "1 action", "range": "30 feet", "components": "S, M (a pinch of sand)", "duration": "10 minutes", "description": "You make a calming gesture, and up to three willing creatures of your choice that you can see within range fall unconscious for the spell’s duration. The spell ends on a target early if it takes damage or someone uses an action to shake or slap it awake. If a target remains unconscious for the full duration, that target gains the benefit of a short rest, and it can’t be affected by this spell again until it finishes a long rest."}, {"class": "bard", "name": "Clairvoyance", "source": "Player's Handbook", "level": 3, "casting": "10 minutes", "range": "1 mile", "components": "V, S, M (a focus worth at least 100 gp, either a jeweled horn for hearing or a glass eye for seeing)", "duration": "Concentration, up to 10 minutes", "description": "You create an invisible sensor within range in a location familiar to you (a place you have visited or seen before) or in an obvious location that is unfamiliar to you (such as behind a door, around a corner, or in a grove of trees). The sensor remains in place for the duration, and it can’t be attacked or otherwise interacted with."}, {"class": "bard", "name": "Dispel Magic", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "120 feet", "components": "V, S", "duration": "Instantaneous", "description": "Choose any creature, object, or magical effect within range. Any spell of 3rd level or lower on the target ends. For each spell of 4th level or higher on the target, make an ability check using your spellcasting ability. The DC equals 10 + the spell's level. On a successful check, the spell ends."}, {"class": "bard", "name": "Enemies Abound", "source": "Xanathar's Guide to Everything", "level": 3, "casting": "1 action", "range": "120 feet", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "You reach into the mind of one creature you can see and force it to make an Intelligence saving throw. A creature automatically succeeds if it is immune to being frightened. On a failed save, the target loses the ability to distinguish friend from foe, regarding all creatures it can see as enemies until the spell ends. Each time the target takes damage, it can repeat the saving throw, ending the effect on itself on a success."}, {"class": "bard", "name": "Fast Friends", "source": "Acquisitions Inc.", "level": 3, "casting": "1 action", "range": "30 feet", "components": "V", "duration": "Concentration, up to 1 hour", "description": "When you cast this spell, choose one humanoid within range that can see and hear you, and that can understand you. The creature must succeed on a Wisdom saving throw or become charmed by you for the duration. While the creature is charmed in this way, it undertakes to perform any services or activities you ask of it in a friendly manner, to the best of its ability."}, {"class": "bard", "name": "Fear", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "Self (30-foot cone)", "components": "V, S, M (a white feather or the heart of a hen)", "duration": "Concentration, up to 1 minute", "description": "You project a phantasmal image of a creature’s worst fears. Each creature in a 30-foot cone must succeed on a Wisdom saving throw or drop whatever it is holding and become frightened for the duration."}, {"class": "bard", "name": "Feign Death", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "Touch", "components": "V, S, M (a pinch of graveyard dirt)", "duration": "1 hour", "description": "You touch a willing creature and put it into a cataleptic state that is indistinguishable from death."}, {"class": "bard", "name": "Glyph of Warding", "source": "Player's Handbook", "level": 3, "casting": "1 hour", "range": "Touch", "components": "V, S, M (incense and powdered diamond worth at least 200 gp, which the spell consumes)", "duration": "Until dispelled or triggered", "description": "When you cast this spell, you inscribe a glyph that creates a magical effect triggered by other creatures, either upon a surface (such as a table or a section of floor or wall) or within an object that can be closed (such as a book, a scroll, or a treasure chest) to conceal the glyph. The glyph can cover an area no larger than 10 feet in diameter. If the surface or object is moved more than 10 feet from where you cast this spell, the glyph is broken, and the spell ends without being triggered."}, {"class": "bard", "name": "Hypnotic Pattern", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "120 feet", "components": "S, M (a glowing stick of incense or a crystal vial filled with phosphorescent material)", "duration": "Concentration, up to 1 minute", "description": "You create a twisting pattern of colors that weaves through the air inside a 30-foot cube within range. The pattern appears for a moment and vanishes. Each creature in the area who sees the pattern must make a Wisdom saving throw. On a failed save, the creature becomes charmed for the duration. While charmed by this spell, the creature is incapacitated and has a speed of 0."}, {"class": "bard", "name": "Intellect Fortress", "source": "Tasha's Cauldron of Everything", "level": 3, "casting": "1 action", "range": "30 feet", "components": "V", "duration": "Concentration, up to 1 hour", "description": "For the duration, you or one willing creature you can see within range has resistance to psychic damage, as well as advantage on Intelligence, Wisdom, and Charisma saving throws."}, {"class": "bard", "name": "Leomund's Tiny Hut", "source": "Player's Handbook", "level": 3, "casting": "1 minute", "range": "Self (10-foot-radius hemisphere)", "components": "V, S, M (a small crystal bead)", "duration": "8 hours", "description": "A 10-foot-radius immobile dome of force springs into existence around and above you and remains stationary for the duration. The spell ends if you leave its area."}, {"class": "bard", "name": "Major Image", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "120 feet", "components": "V, S, M (a bit of fleece)", "duration": "Concentration, up to 10 minutes", "description": "You create the image of an object, a creature, or some other visible phenomenon that is no larger than a 20-foot cube. The image appears at a spot that you can see within range and lasts for the duration. It seems completely real, including sounds, smells, and temperature appropriate to the thing depicted. You can’t create sufficient heat or cold to cause damage, a sound loud enough to deal thunder damage or deafen a creature, or a smell that might sicken a creature (like a troglodyte’s stench)."}, {"class": "bard", "name": "Mass Healing Word", "source": "Player's Handbook", "level": 3, "casting": "1 bonus action", "range": "60 feet", "components": "V", "duration": "Instantaneous", "description": "As you call out words of restoration, up to six creatures of your choice that you can see within range regain hit points equal to 1d4 + your spellcasting ability modifier. This spell has no effect on undead or constructs."}, {"class": "bard", "name": "Motivational Speech", "source": "Acquisitions Inc.", "level": 3, "casting": "1 minute", "range": "60 feet", "components": "V", "duration": "1 hour", "description": "Choose up to five creatures within range that can hear you. For the duration, each affected creature gains 5 temporary hit points and has advantage on Wisdom saving throws. If an affected creature is hit by an attack, it has advantage on the next attack roll it makes. Once an affected creature loses the temporary hit points granted by this spell, the spell ends for that creature."}, {"class": "bard", "name": "Nondetection", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "Touch", "components": "V, S, M (a pinch of diamond dust worth 25 gp sprinkled over the target, which the spell consumes)", "duration": "8 hours", "description": "For the duration, you hide a target that you touch from divination magic. The target can be a willing creature or a place or an object no larger than 10 feet in any dimension. The target can’t be targeted by any divination magic or perceived through magical scrying sensors."}, {"class": "bard", "name": "Plant Growth", "source": "Player's Handbook", "level": 3, "casting": "1 action or 8 hours", "range": "150 feet", "components": "V, S", "duration": "Instantaneous", "description": "This spell channels vitality into plants within a specific area. There are two possible uses for the spell, granting either immediate or long-term benefits."}, {"class": "bard", "name": "Sending", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "Unlimited", "components": "V, S, M (a short piece of fine copper wire)", "duration": "1 round", "description": "You send a short message of twenty-five words or less to a creature with which you are familiar. The creature hears the message in its mind, recognizes you as the sender if it knows you, and can answer in a like manner immediately. The spell enables creatures with Intelligence scores of at least 1 to understand the meaning of your message."}, {"class": "bard", "name": "Slow", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "120 feet", "components": "V, S, M (a drop of molasses)", "duration": "Concentration, up to 1 minute", "description": "You alter time around up to six creatures of your choice in a 40-foot cube within range. Each target must succeed on a Wisdom saving throw or be affected by this spell for the duration."}, {"class": "bard", "name": "Speak with Dead", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "10 feet", "components": "V, S, M (burning incense)", "duration": "10 minutes", "description": "You grant the semblance of life and intelligence to a corpse of your choice within range, allowing it to answer the questions you pose. The corpse must still have a mouth and can’t be undead. The spell fails if the corpse was the target of this spell within the last 10 days."}, {"class": "bard", "name": "Speak with Plants", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "Self (30-foot radius)", "components": "V, S", "duration": "10 minutes", "description": "You imbue plants within 30 feet of you with limited sentience and animation, giving them the ability to communicate with you and follow your simple commands. You can question plants about events in the spell’s area within the past day, gaining information about creatures that have passed, weather, and other circumstances."}, {"class": "bard", "name": "Stinking Cloud", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "90 feet", "components": "V, S, M (a rotten egg or several skunk cabbage leaves)", "duration": "Concentration, up to 1 minute", "description": "You create a 20-foot-radius sphere of yellow, nauseating gas centered on a point within range. The cloud spreads around corners, and its area is heavily obscured. The cloud lingers in the air for the duration."}, {"class": "bard", "name": "Tongues", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "Touch", "components": "V, M (a small clay model of a ziggurat)", "duration": "1 hour", "description": "This spell grants the creature you touch the ability to understand any spoken language it hears. Moreover, when the target speaks, any creature that knows at least one language and can hear the target understands what it says."}, {"class": "bard", "name": "Charm Monster", "source": "Xanathar's Guide to Everything", "level": 4, "casting": "1 action", "range": "30 feet", "components": "V, S", "duration": "1 hour", "description": "You attempt to charm a creature you can see within range. It must make a Wisdom saving throw, and it does so with advantage if you or your companions are fighting it. If it fails the saving throw, it is charmed by you until the spell ends or until you or your companions do anything harmful to it. The charmed creature is friendly to you. When the spell ends, the creature knows it was charmed by you."}, {"class": "bard", "name": "Compulsion", "source": "Player's Handbook", "level": 4, "casting": "1 action", "range": "30 feet", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "Creatures of your choice that you can see within range and that can hear you must make a Wisdom saving throw. A target automatically succeeds on this saving throw if it can’t be charmed. On a failed save, a target is affected by this spell. Until the spell ends, you can use a bonus action on each of your turns to designate a direction that is horizontal to you. Each affected target must use as much of its movement as possible to move in that direction on its next turn. It can take its action before it moves. After moving in this way, it can make another Wisdom saving throw to try to end the effect."}, {"class": "bard", "name": "Confusion", "source": "Player's Handbook", "level": 4, "casting": "1 action", "range": "90 feet", "components": "V, S, M (three nut shells)", "duration": "Concentration, up to 1 minute", "description": "This spell assaults and twists creatures’ minds, spawning delusions and provoking uncontrolled actions. Each creature in a 10-foot-radius sphere centered on a point you choose within range must succeed on a Wisdom saving throw when you cast this spell or be affected by it."}, {"class": "bard", "name": "Dimension Door", "source": "Player's Handbook", "level": 4, "casting": "1 action", "range": "500 feet", "components": "V", "duration": "Instantaneous", "description": "You teleport yourself from your current location to any other spot within range. You arrive at exactly the spot desired. It can be a place you can see, one you can visualize, or one you can describe by stating distance and direction, such as \"200 feet straight downward\" or \"upward to the northwest at a 45-degree angle, 300 feet\"."}, {"class": "bard", "name": "Freedom of Movement", "source": "Player's Handbook", "level": 4, "casting": "1 action", "range": "Touch", "components": "V, S, M (a leather strap, bound around the arm or a similar appendage)", "duration": "1 hour", "description": "You touch a willing creature. For the duration, the target’s movement is unaffected by difficult terrain, and spells and other magical effects can neither reduce the target’s speed nor cause the target to be paralyzed or restrained."}, {"class": "bard", "name": "Greater Invisibility", "source": "Player's Handbook", "level": 4, "casting": "1 action", "range": "Touch", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "You or a creature you touch becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target’s person."}, {"class": "bard", "name": "Hallucinatory Terrain", "source": "Player's Handbook", "level": 4, "casting": "10 minutes", "range": "300 feet", "components": "V, S, M (a stone, a twig, and a bit of green plant)", "duration": "24 hours", "description": "You make natural terrain in a 150-foot cube in range look, sound, and smell like some other sort of natural terrain. Thus, open fields or a road can be made to resemble a swamp, hill, crevasse, or some other difficult or impassable terrain. A pond can be made to seem like a grassy meadow, a precipice like a gentle slope, or a rock-strewn gully like a wide and smooth road. Manufactured structures, equipment, and creatures within the area aren’t changed in appearance."}, {"class": "bard", "name": "Locate Creature", "source": "Player's Handbook", "level": 4, "casting": "1 action", "range": "Self", "components": "V, S, M (a bit of fur from a bloodhound)", "duration": "Concentration, up to 1 hour", "description": "Describe or name a creature that is familiar to you. You sense the direction to the creature’s location, as long as that creature is within 1,000 feet of you. If the creature is moving, you know the direction of its movement."}, {"class": "bard", "name": "Phantasmal Killer", "source": "Player's Handbook", "level": 4, "casting": "1 action", "range": "120 feet", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "You tap into the nightmares of a creature you can see within range and create an illusory manifestation of its deepest fears, visible only to that creature."}, {"class": "bard", "name": "Polymorph", "source": "Player's Handbook", "level": 4, "casting": "1 action", "range": "60 feet", "components": "V, S, M (a caterpillar cocoon)", "duration": "Concentration, up to 1 hour", "description": "This spell transforms a creature that you can see within range into a new form. An unwilling creature must make a Wisdom saving throw to avoid the effect. A shapechanger automatically succeeds on this saving throw."}, {"class": "bard", "name": "Raulothim's Psychic Lance", "source": "Fizban's Treasury of Dragons", "level": 4, "casting": "1 Action", "range": "120ft", "components": "V", "duration": "Instantaneous", "description": "You unleash a shimmering lance of psychic power from your forehead at a creature that you can see within range. Alternatively, you can utter a creature’s name. If the named target is within range, it becomes the spell’s target even if you can’t see it. If the named target isn’t within range, the lance dissipates without effect."}, {"class": "bard", "name": "Animate Objects", "source": "Player's Handbook", "level": 5, "casting": "1 action", "range": "120 feet", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "Objects come to life at your command. Choose up to ten nonmagical objects within range that are not being worn or carried. Medium targets count as two objects, Large targets count as four objects, Huge targets count as eight objects. You can’t animate any object larger than Huge. Each target animates and becomes a creature under your control until the spell ends or until reduced to 0 hit points."}, {"class": "bard", "name": "Awaken", "source": "Player's Handbook", "level": 5, "casting": "8 hours", "range": "Touch", "components": "V, S, M (an agate worth at least 1,000 gp, which the spell consumes)", "duration": "Instantaneous", "description": "After spending the casting time tracing magical pathways within a precious gemstone, you touch a huge or smaller beast or plant. The target must have either no Intelligence score or an Intelligence of 3 or less."}, {"class": "bard", "name": "Dominate Person", "source": "Player's Handbook", "level": 5, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "You attempt to beguile a humanoid that you can see within range. It must succeed on a Wisdom saving throw or be charmed by you for the duration. If you or creatures that are friendly to you are fighting it, it has advantage on the saving throw."}, {"class": "bard", "name": "Dream", "source": "Player's Handbook", "level": 5, "casting": "1 minute", "range": "Special", "components": "V, S, M (a handful of sand, a dab of ink, and a writing quill plucked from a sleeping bird)", "duration": "8 hours", "description": "This spell shapes a creature’s dreams. Choose a creature known to you as the target of this spell. The target must be on the same plane of existence as you. Creatures that don’t sleep, such as elves, can’t be contacted by this spell. You, or a willing creature you touch, enters a trance state, acting as a messenger. While in the trance, the messenger is aware of their surroundings, but can’t take actions or move."}, {"class": "bard", "name": "Geas", "source": "Player's Handbook", "level": 5, "casting": "1 minute", "range": "60 feet", "components": "V", "duration": "30 days", "description": "You place a magical command on a creature that you can see within range, forcing it to carry out some service or refrain from some action or course of activity as you decide."}, {"class": "bard", "name": "Greater Restoration", "source": "Player's Handbook", "level": 5, "casting": "1 action", "range": "Touch", "components": "V, S, M (diamond dust worth at least 100 gp, which the spell consumes)", "duration": "Instantaneous", "description": "You imbue a creature you touch with positive energy to undo a debilitating effect. You can reduce the target’s exhaustion level by one, or end one of the following effects on the target:"}, {"class": "bard", "name": "Hold Monster", "source": "Player's Handbook", "level": 5, "casting": "1 action", "range": "90 feet", "components": "V, S, M (a small, straight piece of iron)", "duration": "Concentration, up to 1 minute", "description": "Choose a creature that you can see within range. The target must succeed on a Wisdom saving throw or be paralyzed for the duration. This spell has no effect on undead. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the spell ends on the target."}, {"class": "bard", "name": "Legend Lore", "source": "Player's Handbook", "level": 5, "casting": "10 minutes", "range": "Self", "components": "V, S, M (incense worth at least 250 gp, which the spell consumes, and four ivory strips worth at least 50 gp each)", "duration": "Instantaneous", "description": "Name or describe a person, place, or object. The spell brings to your mind a brief summary of the significant lore about the thing you named. The lore might consist of current tales, forgotten stories, or even secret lore that has never been widely known. If the thing you named isn’t of legendary importance, you gain no information. The more information you already have about the thing, the more precise and detailed the information you receive is."}, {"class": "bard", "name": "Mass Cure Wounds", "source": "Player's Handbook", "level": 5, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "Instantaneous", "description": "A wave of healing energy washes out from a point of your choice within range. Choose up to six creatures in a 30-foot-radius sphere centered on that point. Each target regains hit points equal to 3d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs."}, {"class": "bard", "name": "Mislead", "source": "Player's Handbook", "level": 5, "casting": "1 action", "range": "Self", "components": "S", "duration": "Concentration, up to 1 hour", "description": "You become invisible at the same time that an illusory double of you appears where you are standing. The double lasts for the duration, but the invisibility ends if you attack or cast a spell."}, {"class": "bard", "name": "Modify Memory", "source": "Player's Handbook", "level": 5, "casting": "1 action", "range": "30 feet", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "You attempt to reshape another creature’s memories. One creature that you can see must make a Wisdom saving throw. If you are fighting the creature, it has advantage on the saving throw. On a failed save, the target becomes charmed by you for the duration. The charmed target is incapacitated and unaware of its surroundings, though it can still hear you. If it takes any damage or is targeted by another spell, this spell ends, and none of the target’s memories are modified."}, {"class": "bard", "name": "Planar Binding", "source": "Player's Handbook", "level": 5, "casting": "1 hour", "range": "60 feet", "components": "V, S, M (a jewel worth at least 1,000 gp, which the spell consumes)", "duration": "24 hours", "description": "With this spell, you attempt to bind a celestial, an elemental, a fey, or a fiend to your service. The creature must be within range for the entire casting of the spell. (Typically, the creature is first summoned into the center of an inverted Magic Circle in order to keep it trapped while this spell is cast.) At the completion of the casting, the target must make a Charisma saving throw. On a failed save, it is bound to serve you for the duration. If the creature was summoned or created by another spell, that spell’s duration is extended to match the duration of this spell."}, {"class": "bard", "name": "Raise Dead", "source": "Player's Handbook", "level": 5, "casting": "1 hour", "range": "Touch", "components": "V, S, M (a diamond worth at least 500 gp, which the spell consumes)", "duration": "Instantaneous", "description": "You return a dead creature you touch to life, provided that it has been dead no longer than 10 days. If the creature’s soul is both willing and at liberty to rejoin the body, the creature returns to life with 1 hit point."}, {"class": "bard", "name": "Rary's Telepathic Bond", "source": "Player's Handbook", "level": 5, "casting": "1 action", "range": "30 feet", "components": "V, S, M (pieces of eggshell from two different kinds of creatures)", "duration": "1 hour", "description": "You forge a telepathic link among up to eight willing creatures of your choice within range, psychically linking each creature to all the others for the duration. Creatures with Intelligence scores of 2 or less aren’t affected by this spell."}, {"class": "bard", "name": "Scrying", "source": "Player's Handbook", "level": 5, "casting": "10 minutes", "range": "Self", "components": "V, S, M (a focus worth at least 1,000 gp, such as a crystal ball, a silver mirror, or a font filled with holy water)", "duration": "Concentration, up to 10 minutes", "description": "You can see and hear a particular creature you choose that is on the same plane of existence as you. The target must make a Wisdom saving throw, which is modified by how well you know the target and the sort of physical connection you have to it. If a target knows you’re casting this spell, it can fail the saving throw voluntarily if it wants to be observed."}, {"class": "bard", "name": "Seeming", "source": "Player's Handbook", "level": 5, "casting": "1 action", "range": "30 feet", "components": "V, S", "duration": "8 hours", "description": "This spell allows you to change the appearance of any number of creatures that you can see within range. You give each target you choose a new, illusory appearance. An unwilling target can make a Charisma saving throw, and if it succeeds, it is unaffected by this spell."}, {"class": "bard", "name": "Skill Empowerment", "source": "Xanathar's Guide to Everything", "level": 5, "casting": "1 action", "range": "Touch", "components": "V, S", "duration": "Concentration, up to 1 hour", "description": "Your magic deepens a creature’s understanding of its own talent. You touch one willing creature and give it expertise in one skill of your choice; until the spell ends, the creature doubles its proficiency bonus for ability checks it makes that use the chosen skill."}, {"class": "bard", "name": "Synaptic Static", "source": "Xanathar's Guide to Everything", "level": 5, "casting": "1 action", "range": "120 feet", "components": "V, S", "duration": "Instantaneous", "description": "You choose a point within range and cause psychic energy to explode there. Each creature in a 20-foot-radius sphere centered on that point must make an Intelligence saving throw. A creature with an Intelligence score of 2 or lower can’t be affected by this spell. A target takes 8d6 psychic damage on a failed save, or half as much damage on a successful one."}, {"class": "bard", "name": "Teleportation Circle", "source": "Player's Handbook", "level": 5, "casting": "1 minute", "range": "10 feet", "components": "V, M (rare chalks and inks infused with precious gems worth 50 gp, which the spell consumes)", "duration": "1 round", "description": "As you cast the spell, you draw a 10-foot-diameter circle on the ground inscribed with sigils that link your location to a permanent teleportation circle of your choice whose sigil sequence you know and that is on the same plane of existence as you."}, {"class": "bard", "name": "Eyebite", "source": "Player's Handbook", "level": 6, "casting": "1 action", "range": "Self", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "For the spell’s duration, your eyes become an inky void imbued with dread power. One creature of your choice within 60 feet of you that you can see must succeed on a Wisdom saving throw or be affected by one of the following effects of your choice for the duration. On each of your turns until the spell ends, you can use your action to target another creature but can’t target a creature again if it has succeeded on a saving throw against this casting of eyebite."}, {"class": "bard", "name": "Find the Path", "source": "Player's Handbook", "level": 6, "casting": "1 minute", "range": "Self", "components": "V, S, M (a set of divinatory tools – such as bones, ivory sticks, cards, teeth, or carved runes – worth 100 gp, and an object from the location you wish to find)", "duration": "Concentration, up to 1 day", "description": "This spell allows you to find the shortest, most direct physical route to a specific fixed location that you are familiar with on the same plane of existence. If you name a destination on another plan of existence, a destination that moves (such as a mobile fortress), or a destination that isn’t specific (such as \"a green dragon’s lair”), the spell fails."}, {"class": "bard", "name": "Guards and Wards", "source": "Player's Handbook", "level": 6, "casting": "10 minutes", "range": "Touch", "components": "V, S, M (burning incense, a small measure of brimstone and oil, a knotted string, a small amount of umber hulk blood, and a small silver rod worth at least 10 gp)", "duration": "24 hours", "description": "You create a ward that protects up to 2,500 square feet of floor space (an area 50 feet square, or one hundred 5-foot squares or twenty-five 10-foot squares). The warded area can be up to 20 feet tall, and shaped as you desire. You can ward several stories of a stronghold by dividing the area among them, as long as you can walk into each contiguous area while you are casting the spell."}, {"class": "bard", "name": "Heroes' Feast", "source": "Player's Handbook", "level": 6, "casting": "10 minutes", "range": "30 feet", "components": "V, S, M (a gem-encrusted bowl worth at least 1,000 gp, which the spell consumes)", "duration": "Instantaneous", "description": "You bring forth a great feast, including magnificent food and drink. The feast takes 1 hour to consume and disappears at the end of that time, and the beneficial effects don’t set in until this hour is over. Up to twelve creatures can partake of the feast."}, {"class": "bard", "name": "Mass Suggestion", "source": "Player's Handbook", "level": 6, "casting": "1 action", "range": "60 feet", "components": "V, M (a snake’s tongue and either a bit of honeycomb or a drop of sweet oil)", "duration": "24 hours", "description": "You suggest a course of activity (limited to a sentence or two) and magically influence up to twelve creatures of your choice that you can see within range and that can hear and understand you. Creatures that can’t be charmed are immune to this effect. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to stab itself, throw itself onto a spear, immolate itself, or do some other obviously harmful act automatically negates the effect of the spell."}, {"class": "bard", "name": "Otto's Irresistible Dance", "source": "Player's Handbook", "level": 6, "casting": "1 action", "range": "30 feet", "components": "V", "duration": "Concentration, up to 1 minute", "description": "Choose one creature that you can see within range. The target begins a comic dance in place: shuffling, tapping its feet, and capering for the duration. Creatures that can’t be charmed are immune to this spell."}, {"class": "bard", "name": "Programmed Illusion", "source": "Player's Handbook", "level": 6, "casting": "1 action", "range": "120 feet", "components": "V, S, M (a bit of fleece and jade dust worth at least 25 gp)", "duration": "Until dispelled", "description": "You create an illusion of an object, a creature, or some other visible phenomenon within range that activates when a specific condition occurs. The illusion is imperceptible until then. It must be no larger than a 30-foot cube, and you decide when you cast the spell how the illusion behaves and what sounds it makes. This scripted performance can last up to 5 minutes."}, {"class": "bard", "name": "True Seeing", "source": "Player's Handbook", "level": 6, "casting": "1 action", "range": "Touch", "components": "V, S, M (an ointment for the eyes that costs 25 gp; is made from mushroom powder, saffron, and fat; and is consumed by the spell)", "duration": "1 hour", "description": "This spell gives the willing creature you touch the ability to see things as they actually are. For the duration, the creature has truesight, notices secret doors hidden by magic, and can see into the Ethereal Plane, all out to a range of 120 feet."}, {"class": "bard", "name": "Dream of the Blue Veil", "source": "Tasha's Cauldron of Everything", "level": 7, "casting": "10 minutes", "range": "20 feet", "components": "V, S, M (a magic item or a willing creature from the destination world)", "duration": "6 hours", "description": "You and up to eight willing creatures within range fall unconscious for the spells’ duration and experience visions of another world on the Material Plane, such as Oerth, Toril, Krynn, or Eberron. If the spell reaches its full duration, the visions conclude with each of you encountering and pulling back a mysterious blue curtain. The spell then ends with you mentally and physically transported to the world that was in the visions."}, {"class": "bard", "name": "Etherealness", "source": "Player's Handbook", "level": 7, "casting": "1 action", "range": "Self", "components": "V, S", "duration": "Up to 8 hours", "description": "You step into the border regions of the Ethereal Plane, in the area where it overlaps with your current plane. You remain in the Border Ethereal for the duration or until you use your action to dismiss the spell. During this time, you can move in any direction. If you move up or down, every foot of movement costs an extra foot. You can see and hear the plane you originated from, but everything there looks gray, and you can’t see anything more than 60 feet away."}, {"class": "bard", "name": "Forcecage", "source": "Player's Handbook", "level": 7, "casting": "1 action", "range": "100 feet", "components": "V, S, M (ruby dust worth 1,500 gp)", "duration": "1 hour", "description": "An immobile, invisible, cube-shaped prison composed of magical force springs into existence around an area you choose within range. The prison can be a cage or a solid box as you choose."}, {"class": "bard", "name": "Mirage Arcane", "source": "Player's Handbook", "level": 7, "casting": "10 minutes", "range": "Sight", "components": "V, S", "duration": "10 days", "description": "You make terrain in an area up to 1 mile square look, sound, smell, and even feel like some other sort of terrain. The terrain’s general shape remains the same, however. Open fields or a road could be made to resemble a swamp, hill, crevasse, or some other difficult or impassable terrain. A pond can be made to seem like a grassy meadow, a precipice like a gentle slope, or a rock-strewn gully like a wide and smooth road."}, {"class": "bard", "name": "Mordenkainen's Magnificent Mansion", "source": "Player's Handbook", "level": 7, "casting": "1 minute", "range": "300 feet", "components": "V, S, M (a miniature portal carved from ivory, a small piece of polished marble, and a tiny silver spoon, each item worth at least 5 gp)", "duration": "24 hours", "description": "You conjure an extradimensional dwelling in range that lasts for the duration. You choose where its one entrance is located. The entrance shimmers faintly and is 5 feet wide and 10 feet tall. You and any creature you designate when you cast the spell can enter the extradimensional dwelling as long as the portal remains open. You can open or close the portal if you are within 30 feet of it. While closed, the portal is invisible."}, {"class": "bard", "name": "Mordenkainen's Sword", "source": "Player's Handbook", "level": 7, "casting": "1 action", "range": "60 feet", "components": "V, S, M (a miniature platinum sword with a grip and pommel of copper and zinc, worth 250 gp)", "duration": "Concentration, up to 1 minute", "description": "You create a sword-shaped plane of force that hovers within range. It lasts for the duration."}, {"class": "bard", "name": "Prismatic Spray", "source": "Player's Handbook", "level": 7, "casting": "1 action", "range": "Self (60-foot cone)", "components": "V, S", "duration": "Instantaneous", "description": "Eight multicolored rays of light flash from your hand. Each ray is a different color and has a different power and purpose. Each creature in a 60-foot cone must make a Dexterity saving throw. For each target, roll a d8 to determine which color ray affects it."}, {"class": "bard", "name": "Project Image", "source": "Player's Handbook", "level": 7, "casting": "1 action", "range": "500 miles", "components": "V, S, M (a small replica of you made from materials worth at least 5 gp)", "duration": "Concentration, up to 1 day", "description": "You create an illusory copy of yourself that lasts for the duration. The copy can appear at any location within range that you have seen before, regardless of intervening obstacles. The illusion looks and sounds like you but is intangible. If the illusion takes any damage, it disappears, and the spell ends."}, {"class": "bard", "name": "Regenerate", "source": "Player's Handbook", "level": 7, "casting": "1 minute", "range": "Touch", "components": "V, S, M (a prayer wheel and holy water)", "duration": "1 hour", "description": "You touch a creature and stimulate its natural healing ability. The target regains 4d8 + 15 hit points. For the duration of the spell, the target regains 1 hit point at the start of each of its turns (10 hit points each minute)."}, {"class": "bard", "name": "Resurrection", "source": "Player's Handbook", "level": 7, "casting": "1 hour", "range": "Touch", "components": "V, S, M (a diamond worth at least 1,000 gp, which the spell consumes)", "duration": "Instantaneous", "description": "You touch a dead creature that has been dead for no more than a century, that didn’t die of old age, and that isn’t undead. If its soul is free and willing, the target returns to life with all its hit points."}, {"class": "bard", "name": "Symbol", "source": "Player's Handbook", "level": 7, "casting": "1 minute", "range": "Touch", "components": "V, S, M (mercury, phosphorus, and powdered diamond and opal with a total value of at least 1,000 gp, which the spell consumes)", "duration": "Until dispelled or triggered", "description": "When you cast this spell, you inscribe a harmful glyph either on a surface (such as a section of floor, a wall, or a table) or within an object that can be closed to conceal the glyph (such as a book, a scroll, or a treasure chest). If you choose a surface, the glyph can cover an area of the surface no larger than 10 feet in diameter. If you choose an object, that object must remain in its place; if the object is moved more than 10 feet from where you cast this spell, the glyph is broken, and the spell ends without being triggered."}, {"class": "bard", "name": "Teleport", "source": "Player's Handbook", "level": 7, "casting": "1 action", "range": "10 feet", "components": "V", "duration": "Instantaneous", "description": "This spell instantly transports you and up to eight willing creatures of your choice that you can see within range, or a single object that you can see within range, to a destination you select. If you target an object, it must be able to fit entirely inside a 10-foot cube, and it can’t be held or carried by an unwilling creature."}, {"class": "bard", "name": "Antipathy/Sympathy", "source": "Player's Handbook", "level": 8, "casting": "1 hour", "range": "60 feet", "components": "V, S, M (either a lump of alum soaked in vinegar for the antipathy effect or a drop of honey for the sympathy effect)", "duration": "10 days", "description": "This spell attracts or repels creatures of your choice. You target something within range, either a Huge or smaller object or creature or an area that is no larger than a 200-foot cube. Then specify a kind of intelligent creature, such as red dragons, goblins, or vampires. You invest the target with an aura that either attracts or repels the specified creatures for the duration. Choose antipathy or sympathy as the aura’s effect."}, {"class": "bard", "name": "Dominate Monster", "source": "Player's Handbook", "level": 8, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "Concentration, up to 1 hour", "description": "You attempt to beguile a creature that you can see within range. It must succeed on a Wisdom saving throw or be charmed by you for the duration. If you or creatures that are friendly to you are fighting it, it has advantage on the saving throw."}, {"class": "bard", "name": "Feeblemind", "source": "Player's Handbook", "level": 8, "casting": "1 action", "range": "150 feet", "components": "V, S, M (a handful of clay, crystal, glass, or mineral spheres)", "duration": "Instantaneous", "description": "You blast the mind of a creature that you can see within range, attempting to shatter its intellect and personality. The target takes 4d6 psychic damage and must make an Intelligence saving throw."}, {"class": "bard", "name": "Glibness", "source": "Player's Handbook", "level": 8, "casting": "1 action", "range": "Self", "components": "V", "duration": "1 hour", "description": "Until the spell ends, when you make a Charisma check, you can replace the number you roll with a 15. Additionally, no matter what you say, magic that would determine if you are telling the truth indicates that you are being truthful."}, {"class": "bard", "name": "Mind Blank", "source": "Player's Handbook", "level": 8, "casting": "1 action", "range": "Touch", "components": "V, S", "duration": "24 hours", "description": "Until the spell ends, one willing creature you touch is immune to psychic damage, any effect that would sense its emotions or read its thoughts, divination spells, and the charmed condition. The spell even foils wish spells and spells or effects of similar power used to affect the target's mind or to gain information about the target."}, {"class": "bard", "name": "Power Word: Stun", "source": "Player's Handbook", "level": 8, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "Instantaneous", "description": "You speak a word of power that can overwhelm the mind of one creature you can see within range, leaving it dumbfounded. If the target has 150 hit points or fewer, it is stunned. Otherwise, the spell has no effect. The stunned target must make a Constitution saving throw at the end of each of its turns. On a successful save, this stunning effect ends."}, {"class": "bard", "name": "Foresight", "source": "Player's Handbook", "level": 9, "casting": "1 minute", "range": "Touch", "components": "V, S, M (a hummingbird feather)", "duration": "8 hours", "description": "You touch a willing creature and bestow a limited ability to see into the immediate future. For the duration, the target can’t be surprised and has advantage on attack rolls, ability checks, and saving throws. Additionally, other creatures have disadvantage on attack rolls against the target for the duration. This spell immediately ends if you cast it again before its duration ends."}, {"class": "bard", "name": "Mass Polymorph", "source": "Xanathar's Guide to Everything", "level": 9, "casting": "1 Action", "range": "120 feet", "components": "V, S, M (a caterpillar cocoon)", "duration": "Concentration, up to 1 hour", "description": "You transform up to ten creatures of your choice that you can see within range. An unwilling target must succeed on a Wisdom saving throw to resist the transformation. An unwilling shapechanger automatically succeeds on the save."}, {"class": "bard", "name": "Power Word: Heal", "source": "Player's Handbook", "level": 9, "casting": "1 action", "range": "Touch", "components": "V, S", "duration": "Instantaneous", "description": "A wave of healing energy washes over a creature you touch. The target regains all its hit points. If the creature is charmed, frightened, paralyzed, or stunned, the condition ends. If the creature is prone, it can use its reaction to stand up. This spell has no effect on undead or constructs."}, {"class": "bard", "name": "Power Word: Kill", "source": "Player's Handbook", "level": 9, "casting": "1 action", "range": "60 feet", "components": "V", "duration": "Instantaneous", "description": "You utter a word of power that can compel one creature you can see within range to die instantly. If the creature you chose has 100 hit points or fewer, it dies. Otherwise, the spell has no effect."}, {"class": "bard", "name": "Prismatic Wall", "source": "Player's Handbook", "level": 9, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "10 minutes", "description": "A shimmering, multicolored plane of light forms a vertical opaque wall – up to 90 feet long, 30 feet high, and 1 inch thick – centered on a point you can see within range. Alternatively, you can shape the wall into a sphere up to 30 feet in diameter centered on a point you choose within range. The wall remains in place for the duration. If you position the wall so that it passes through a space occupied by a creature, the spell fails, and your action and the spell slot are wasted."}, {"class": "bard", "name": "Psychic Scream", "source": "Xanathar's Guide to Everything", "level": 9, "casting": "1 action", "range": "90 feet", "components": "S", "duration": "Instantaneous", "description": "You unleash the power of your mind to blast the intellect of up to ten creatures of your choice that you can see within range. Creatures that have an Intelligence score of 2 or lower are unaffected.\nEach target must make an Intelligence saving throw. On a failed save, a target takes 14d6 psychic damage and is stunned. On a successful save, a target takes half as much damage and isn’t stunned. If a target is killed by this damage, its head explodes, assuming it has one."}, {"class": "bard", "name": "True Polymorph", "source": "Player's Handbook", "level": 9, "casting": "1 action", "range": "30 feet", "components": "V, S, M (a drop of mercury, a dollop of gum arabic, and a wisp of smoke)", "duration": "Concentration, up to 1 hour", "description": "Choose one creature or nonmagical object that you can see within range. You transform the creature into a different creature, the creature into a nonmagical object, or the object into a creature (the object must be neither worn nor carried by another creature). The transformation lasts for the duration, or until the target drops to 0 hit points or dies. If you concentrate on this spell for the full duration, the transformation becomes permanent."}]