[{"class": "cleric", "name": "Guidance", "source": "Player's Handbook", "level": 0, "casting": "1 action", "range": "Touch", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "You touch one willing creature. Once before the spell ends, the target can roll a d4 and add the number rolled to one ability check of its choice. It can roll the die before or after making the ability check. The spell then ends."}, {"class": "cleric", "name": "Light", "source": "Player's Handbook", "level": 0, "casting": "1 action", "range": "Touch", "components": "V, M (a firefly or phosphorescent moss)", "duration": "1 hour", "description": "You touch one object that is no larger than 10 feet in any dimension. Until the spell ends, the object sheds bright light in a 20-foot radius and dim light for an additional 20 feet. The light can be colored as you like. Completely covering the object with something opaque blocks the light. The spell ends if you cast it again or dismiss it as an action."}, {"class": "cleric", "name": "Mending", "source": "Player's Handbook", "level": 0, "casting": "1 minute", "range": "Touch", "components": "V, S, M (two lodestones)", "duration": "Instantaneous", "description": "This spell repairs a single break or tear in an object you touch, such as a broken chain link, two halves of a broken key, a torn cloak, or a leaking wineskin. As long as the break or tear is no larger than 1 foot in any dimension, you mend it, leaving no trace of the former damage."}, {"class": "cleric", "name": "Resistance", "source": "Player's Handbook", "level": 0, "casting": "1 action", "range": "Touch", "components": "V, S, M (a miniature cloak)", "duration": "Concentration, up to 1 minute", "description": "You touch one willing creature. Once before the spell ends, the target can roll a d4 and add the number rolled to one saving throw of its choice. It can roll the die before or after the saving throw. The spell then ends."}, {"class": "cleric", "name": "Sacred Flame", "source": "Player's Handbook", "level": 0, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "Instantaneous", "description": "Flame-like radiance descends on a creature that you can see within range. The target must succeed on a Dexterity saving throw or take 1d8 radiant damage. The target gains no benefit from cover for this saving throw."}, {"class": "cleric", "name": "Spare the Dying", "source": "Player's Handbook", "level": 0, "casting": "1 action", "range": "Touch", "components": "V, S", "duration": "Instantaneous", "description": "You touch a living creature that has 0 hit points. The creature becomes stable. This spell has no effect on undead or constructs."}, {"class": "cleric", "name": "Thaumaturgy", "source": "Player's Handbook", "level": 0, "casting": "1 action", "range": "30 feet", "components": "V", "duration": "Up to 1 minute", "description": "You manifest a minor wonder, a sign of supernatural power, within range. You create one of the following magical effects within range:"}, {"class": "cleric", "name": "Toll the Dead", "source": "Xanathar's Guide to Everything", "level": 0, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "Instantaneous", "description": "You point at one creature you can see within range, and the sound of a dolorous bell fills the air around it for a moment. The target must succeed on a Wisdom saving throw or take 1d8 necrotic damage. If the target is missing any of its hit points, it instead takes 1d12 necrotic damage."}, {"class": "cleric", "name": "Word of Radiance", "source": "Xanathar's Guide to Everything", "level": 0, "casting": "1 action", "range": "5 feet", "components": "V, M (a holy symbol)", "duration": "Instantaneous", "description": "You utter a divine word, and burning radiance erupts from you. Each creature of your choice that you can see within range must succeed on a Constitution saving throw or take 1d6 radiant damage."}, {"class": "cleric", "name": "Bane", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "30 feet", "components": "V, S, M (a drop of blood)", "duration": "Concentration, up to 1 minute", "description": "Up to three creatures of your choice that you can see within range must make Charisma saving throws. Whenever a target that fails this saving throw makes an attack roll or a saving throw before the spell ends, the target must roll a d4 and subtract the number rolled from the attack roll or saving throw."}, {"class": "cleric", "name": "Bless", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "30 feet", "components": "V, S, M (a sprinkling of holy water)", "duration": "Concentration, up to 1 minute", "description": "You bless up to three creatures of your choice within range. Whenever a target makes an attack roll or a saving throw before the spell ends, the target can roll a d4 and add the number rolled to the attack roll or saving throw."}, {"class": "cleric", "name": "Ceremony", "source": "Xanathar's Guide to Everything", "level": 1, "casting": "1 hour", "range": "Touch", "components": "V, S, M (25 gp worth of powdered silver, which the spell consumes)", "duration": "Instantaneous (see below)", "description": "You perform one of several religious ceremonies. When you cast the spell, choose one of the following ceremonies, the target of which must be within 10 feet of you throughout the casting."}, {"class": "cleric", "name": "Command", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "60 feet", "components": "V", "duration": "1 round", "description": "You speak a one-word command to a creature you can see within range. The target must succeed on a Wisdom saving throw or follow the command on its next turn. The spell has no effect if the target is undead, if it doesn’t understand your language, or if your command is directly harmful to it. Some typical commands and their effects follow. You might issue a command other than one described here. If you do so, the DM determines how the target behaves. If the target can’t follow your command, the spell ends."}, {"class": "cleric", "name": "Create or Destroy Water", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "30 feet", "components": "V, S, M (a drop of water if creating water or a few grains of sand if destroying it)", "duration": "Instantaneous", "description": "You either create or destroy water."}, {"class": "cleric", "name": "Cure Wounds", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "Touch", "components": "V, S", "duration": "Instantaneous", "description": "A creature you touch regains a number of hit points equal to 1d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs."}, {"class": "cleric", "name": "Detect Evil and Good", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "Self", "components": "V, S", "duration": "Concentration, up to 10 minutes", "description": "For the duration, you know if there is an aberration, celestial, elemental, fey, fiend, or undead within 30 feet of you, as well as where the creature is located. Similarly, you know if there is a place or object within 30 feet of you that has been magically consecrated or desecrated."}, {"class": "cleric", "name": "Detect Magic", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "Self", "components": "V, S", "duration": "Concentration, up to 10 minutes", "description": "For the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any."}, {"class": "cleric", "name": "Detect Poison and Disease", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "Self", "components": "V, S, M (a yew leaf)", "duration": "Concentration, up to 10 minutes", "description": "For the duration, you can sense the presence and location of poisons, poisonous creatures, and diseases within 30 feet of you. You also identify the kind of poison, poisonous creature, or disease in each case."}, {"class": "cleric", "name": "Guiding Bolt", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "120 feet", "components": "V, S", "duration": "1 round", "description": "A flash of light streaks toward a creature of your choice within range. Make a ranged spell attack against the target. On a hit, the target takes 4d6 radiant damage, and the next attack roll made against this target before the end of your next turn has advantage, thanks to the mystical dim light glittering on the target until then."}, {"class": "cleric", "name": "Healing Word", "source": "Player's Handbook", "level": 1, "casting": "1 bonus action", "range": "60 feet", "components": "V", "duration": "Instantaneous", "description": "A creature of your choice that you can see within range regains hit points equal to 1d4 + your spellcasting ability modifier. This spell has no effect on undead or constructs."}, {"class": "cleric", "name": "Inflict Wounds", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "Touch", "components": "V, S", "duration": "Instantaneous", "description": "Make a melee spell attack against a creature you can reach. On a hit, the target takes 3d10 necrotic damage."}, {"class": "cleric", "name": "Protection from Evil and Good", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "Touch", "components": "V, S, M (holy water or powdered silver and iron, which the spell consumes)", "duration": "Concentration, up to 10 minutes", "description": "Until the spell ends, one willing creature you touch is protected against certain types of creatures: aberrations, celestials, elementals, fey, fiends, and undead."}, {"class": "cleric", "name": "Purify Food and Drink", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "10 feet", "components": "V, S", "duration": "Instantaneous", "description": "All nonmagical food and drink within a 5-foot-radius sphere centered on a point of your choice within range is purified and rendered free of poison and disease."}, {"class": "cleric", "name": "Sanctuary", "source": "Player's Handbook", "level": 1, "casting": "1 bonus action", "range": "30 feet", "components": "V, S, M (a small silver mirror)", "duration": "1 minute", "description": "You ward a creature within range against attack. Until the spell ends, any creature who targets the warded creature with an attack or a harmful spell must first make a Wisdom saving throw. On a failed save, the creature must choose a new target or lose the attack or spell. This spell doesn’t protect the warded creature from area effects, such as the explosion of a fireball."}, {"class": "cleric", "name": "Shield of Faith", "source": "Player's Handbook", "level": 1, "casting": "1 bonus action", "range": "60 feet", "components": "V, S, M (a small parchment with a bit of holy text written on it)", "duration": "Concentration, up to 10 minutes", "description": "A shimmering field appears and surrounds a creature of your choice within range, granting it a +2 bonus to AC for the duration."}, {"class": "cleric", "name": "Aid", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "30 feet", "components": "V, S, M (a tiny strip of white cloth)", "duration": "8 hours", "description": "Your spell bolsters your allies with toughness and resolve. Choose up to three creatures within range. Each target’s hit point maximum and current hit points increase by 5 for the duration."}, {"class": "cleric", "name": "Augury", "source": "Player's Handbook", "level": 2, "casting": "1 minute", "range": "Self", "components": "V, S, M (specially marked sticks, bones, or similar tokens worth at least 25 gp)", "duration": "Instantaneous", "description": "By casting gem-inlaid sticks, rolling dragon bones, laying out ornate cards, or employing some other divining tool, you receive an omen from an otherworldly entity about the results of a specific course of action that you plan to take within the next 30 minutes. The DM chooses from the following possible omens:"}, {"class": "cleric", "name": "Blindness/Deafness", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "30 feet", "components": "V", "duration": "1 minute", "description": "You can blind or deafen a foe. Choose one creature that you can see within range to make a Constitution saving throw. If it fails, the target is either blinded or deafened (your choice) for the duration. At the end of each of its turns, the target can make a Constitution saving throw. On a success, the spell ends."}, {"class": "cleric", "name": "Borrowed Knowledge", "source": "Strixhaven", "level": 2, "casting": "1 action", "range": "Self", "components": "V, S, M (a book worth at least 25 gp)", "duration": "1 hour", "description": "You draw on knowledge from spirits of the past. Choose one skill in which you lack proficiency. For the spell's duration, you have proficiency in the chosen skill. The spell ends early if you cast it again."}, {"class": "cleric", "name": "Calm Emotions", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "You attempt to suppress strong emotions in a group of people. Each humanoid in a 20-foot-radius sphere centered on a point you choose within range must make a Charisma saving throw; a creature can choose to fail this saving throw if it wishes. If a creature fails its saving throw, choose one of the following two effects. You can suppress any effect causing a target to be charmed or frightened. When this spell ends, any suppressed effect resumes, provided that its duration has not expired in the meantime."}, {"class": "cleric", "name": "Continual Flame", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "Touch", "components": "V, S, M (ruby dust worth 50 gp, which the spell consumes)", "duration": "Until dispelled", "description": "A flame, equivalent in brightness to a torch, springs forth from an object that you touch. The effect looks like a regular flame, but it creates no heat and doesn’t use oxygen. A continual flame can be covered or hidden but not smothered or quenched."}, {"class": "cleric", "name": "Enhance Ability", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "Touch", "components": "V, S, M (fur or a feather from a beast)", "duration": "Concentration, up to 1 hour", "description": "You touch a creature and bestow upon it a magical enhancement. Choose one of the following effects; the target gains the effect until the spell ends."}, {"class": "cleric", "name": "Find Traps", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "120 feet", "components": "V, S", "duration": "Instantaneous", "description": "You sense the presence of any trap within range that is within line of sight.\nA trap, for the purpose of this spell, includes anything that would inflict a sudden or unexpected effect you consider harmful or undesirable, which was specifically intended as such by its creator. Thus, the spell would sense an area affected by the alarm spell, a glyph of warding, or a mechanical pit trap, but it would not reveal a natural weakness in the floor, an unstable ceiling, or a hidden sinkhole."}, {"class": "cleric", "name": "Gentle Repose", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "Touch", "components": "V, S, M (a pinch of salt and one copper piece placed on each of the corpse’s eyes, which must remain there for the duration)", "duration": "10 days", "description": "You touch a corpse or other remains. For the duration, the target is protected from decay and can’t become undead."}, {"class": "cleric", "name": "Hold Person", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "60 feet", "components": "V, S, M (a small, straight piece of iron)", "duration": "Concentration, up to 1 minute", "description": "Choose a humanoid that you can see within range. The target must succeed on a Wisdom saving throw or be paralyzed for the duration. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the spell ends on the target."}, {"class": "cleric", "name": "Lesser Restoration", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "Touch", "components": "V, S", "duration": "Instantaneous", "description": "You touch a creature and can end either one disease or one condition afflicting it. The condition can be blinded, deafened, paralyzed, or poisoned."}, {"class": "cleric", "name": "Locate Object", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "Self", "components": "V, S, M (a forked twig)", "duration": "Concentration, up to 10 minutes", "description": "Describe or name an object that is familiar to you. You sense the direction to the object’s location, as long as that object is within 1,000 feet of you. If the object is in motion, you know the direction of its movement."}, {"class": "cleric", "name": "Prayer of Healing", "source": "Player's Handbook", "level": 2, "casting": "10 minutes", "range": "30 feet", "components": "V", "duration": "Instantaneous", "description": "Up to six creatures of your choice that you can see within range each regain hit points equal to 2d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs."}, {"class": "cleric", "name": "Protection from Poison", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "Touch", "components": "V, S", "duration": "1 hour", "description": "You touch a creature. If it is poisoned, you neutralize the poison. If more than one poison afflicts the target, you neutralize one poison that you know is present, or you neutralize one at random."}, {"class": "cleric", "name": "Silence", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "120 feet", "components": "V, S", "duration": "Concentration, up to 10 minutes", "description": "For the duration, no sound can be created within or pass through a 20-foot-radius sphere centered on a point you choose within range. Any creature or object entirely inside the sphere is immune to thunder damage, and creatures are deafened while entirely inside it. Casting a spell that includes a verbal component is impossible there."}, {"class": "cleric", "name": "Spiritual Weapon", "source": "Player's Handbook", "level": 2, "casting": "1 bonus action", "range": "60 feet", "components": "V, S", "duration": "1 minute", "description": "You create a floating, spectral weapon within range that lasts for the duration or until you cast this spell again."}, {"class": "cleric", "name": "Warding Bond", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "Touch", "components": "V, S, M (a pair of platinum rings worth at least 50 gp each, which you and target must wear for the duration)", "duration": "1 hour", "description": "This spell wards a willing creature you touch and creates a mystic connection between you and the target until the spell ends."}, {"class": "cleric", "name": "Zone of Truth", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "10 minutes", "description": "You create a magical zone that guards against deception in a 15-foot-radius sphere centered on a point of your choice within range. Until the spell ends, a creature that enters the spell’s area for the first time on a turn or starts its turn there must make a Charisma saving throw. On a failed save, a creature can’t speak a deliberate lie while in the radius. You know whether each creature succeeds or fails on its saving throw."}, {"class": "cleric", "name": "Animate Dead", "source": "Player's Handbook", "level": 3, "casting": "1 minute", "range": "10 feet", "components": "V, S, M (a drop of blood, a piece of flesh, and a pinch of bone dust)", "duration": "Instantaneous", "description": "This spell creates an undead servant. Choose a pile of bones or a corpse of a Medium or Small humanoid within range. Your spell imbues the target with a foul mimicry of life, raising it as an undead creature. The target becomes a skeleton if you chose bones or a zombie if you chose a corpse (the DM has the creature’s game statistics)."}, {"class": "cleric", "name": "Aura of Vitality", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "Self (30-foot radius)", "components": "V", "duration": "Concentration, up to 1 minute", "description": "Healing energy radiates from you in an aura with a 30-foot radius. Until the spell ends, the aura moves with you, centered on you. You can use a bonus action to cause one creature in the aura (including you) to regain 2d6 hit points."}, {"class": "cleric", "name": "Beacon of Hope", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "30 feet", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "This spell bestows hope and vitality. Choose any number of creatures within range. For the duration, each target has advantage on Wisdom saving throws and death saving throws, and regains the maximum number of hit points possible from any healing."}, {"class": "cleric", "name": "Bestow Curse", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "Touch", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "You touch a creature, and that creature must succeed on a Wisdom saving throw or become cursed for the duration of the spell. When you cast this spell, choose the nature of the curse from the following options:"}, {"class": "cleric", "name": "Clairvoyance", "source": "Player's Handbook", "level": 3, "casting": "10 minutes", "range": "1 mile", "components": "V, S, M (a focus worth at least 100 gp, either a jeweled horn for hearing or a glass eye for seeing)", "duration": "Concentration, up to 10 minutes", "description": "You create an invisible sensor within range in a location familiar to you (a place you have visited or seen before) or in an obvious location that is unfamiliar to you (such as behind a door, around a corner, or in a grove of trees). The sensor remains in place for the duration, and it can’t be attacked or otherwise interacted with."}, {"class": "cleric", "name": "Create Food and Water", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "30 feet", "components": "V, S", "duration": "Instantaneous", "description": "You create 45 pounds of food and 30 gallons of water on the ground or in containers within range, enough to sustain up to fifteen humanoids or five steeds for 24 hours. The food is bland but nourishing, and spoils if uneaten after 24 hours. The water is clean and doesn’t go bad."}, {"class": "cleric", "name": "Daylight", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "1 hour", "description": "A 60-foot-radius sphere of light spreads out from a point you choose within range. The sphere is bright light and sheds dim light for an additional 60 feet."}, {"class": "cleric", "name": "Dispel Magic", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "120 feet", "components": "V, S", "duration": "Instantaneous", "description": "Choose any creature, object, or magical effect within range. Any spell of 3rd level or lower on the target ends. For each spell of 4th level or higher on the target, make an ability check using your spellcasting ability. The DC equals 10 + the spell's level. On a successful check, the spell ends."}, {"class": "cleric", "name": "Fast Friends", "source": "Acquisitions Inc.", "level": 3, "casting": "1 action", "range": "30 feet", "components": "V", "duration": "Concentration, up to 1 hour", "description": "When you cast this spell, choose one humanoid within range that can see and hear you, and that can understand you. The creature must succeed on a Wisdom saving throw or become charmed by you for the duration. While the creature is charmed in this way, it undertakes to perform any services or activities you ask of it in a friendly manner, to the best of its ability."}, {"class": "cleric", "name": "Feign Death", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "Touch", "components": "V, S, M (a pinch of graveyard dirt)", "duration": "1 hour", "description": "You touch a willing creature and put it into a cataleptic state that is indistinguishable from death."}, {"class": "cleric", "name": "Glyph of Warding", "source": "Player's Handbook", "level": 3, "casting": "1 hour", "range": "Touch", "components": "V, S, M (incense and powdered diamond worth at least 200 gp, which the spell consumes)", "duration": "Until dispelled or triggered", "description": "When you cast this spell, you inscribe a glyph that creates a magical effect triggered by other creatures, either upon a surface (such as a table or a section of floor or wall) or within an object that can be closed (such as a book, a scroll, or a treasure chest) to conceal the glyph. The glyph can cover an area no larger than 10 feet in diameter. If the surface or object is moved more than 10 feet from where you cast this spell, the glyph is broken, and the spell ends without being triggered."}, {"class": "cleric", "name": "Incite Greed", "source": "Acquisitions Inc.", "level": 3, "casting": "1 action", "range": "30 feet", "components": "V, S, M (a gem worth at least 50 gp)", "duration": "Concentration, up to 1 minute", "description": "When you cast this spell, you present the gem used as the material component and choose any number of creatures within range that can see you. Each target must succeed on a Wisdom saving throw or be charmed by you until the spell ends, or until you or your companions do anything harmful to it. While charmed in this way, a creature can do nothing but use its movement to approach you in a safe manner. While an affected creature is within 5 feel of you, it cannot move, but simply stares greedily at the gem you present."}, {"class": "cleric", "name": "Life Transference", "source": "Xanathar's Guide to Everything", "level": 3, "casting": "1 action", "range": "30 feet", "components": "V, S", "duration": "Instantaneous", "description": "You sacrifice some of your health to mend another creature’s injuries. You take 4d8 necrotic damage, which can’t be reduced in any way, and one creature of your choice that you can see within range regains a number of hit points equal to twice the necrotic damage you take."}, {"class": "cleric", "name": "Magic Circle", "source": "Player's Handbook", "level": 3, "casting": "1 minute", "range": "10 feet", "components": "V, S, M (holy water or powdered silver and iron worth at least 100 gp, which the spell consumes)", "duration": "1 hour", "description": "You create a 10-foot-radius, 20-foot-tall cylinder of magical energy centered on a point on the ground that you can see within range. Glowing runes appear wherever the cylinder intersects with the floor or other surface."}, {"class": "cleric", "name": "Mass Healing Word", "source": "Player's Handbook", "level": 3, "casting": "1 bonus action", "range": "60 feet", "components": "V", "duration": "Instantaneous", "description": "As you call out words of restoration, up to six creatures of your choice that you can see within range regain hit points equal to 1d4 + your spellcasting ability modifier. This spell has no effect on undead or constructs."}, {"class": "cleric", "name": "Meld into Stone", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "Touch", "components": "V, S", "duration": "8 hours", "description": "You step into a stone object or surface large enough to fully contain your body, melding yourself and all the equipment you carry with the stone for the duration. Using your movement, you step into the stone at a point you can touch. Nothing of your presence remains visible or otherwise detectable by nonmagical senses."}, {"class": "cleric", "name": "Motivational Speech", "source": "Acquisitions Inc.", "level": 3, "casting": "1 minute", "range": "60 feet", "components": "V", "duration": "1 hour", "description": "Choose up to five creatures within range that can hear you. For the duration, each affected creature gains 5 temporary hit points and has advantage on Wisdom saving throws. If an affected creature is hit by an attack, it has advantage on the next attack roll it makes. Once an affected creature loses the temporary hit points granted by this spell, the spell ends for that creature."}, {"class": "cleric", "name": "Protection from Energy", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "Touch", "components": "V, S", "duration": "Concentration, up to 1 hour", "description": "For the duration, the willing creature you touch has resistance to one damage type of your choice: acid, cold, fire, lightning, or thunder."}, {"class": "cleric", "name": "Remove Curse", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "Touch", "components": "V, S", "duration": "Instantaneous", "description": "At your touch, all curses affecting one creature or object end. If the object is a cursed magic item, its curse remains, but the spell breaks its owner’s attunement to the object so it can be removed or discarded."}, {"class": "cleric", "name": "Revivify", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "Touch", "components": "V, S, M (diamonds worth 300 gp, which the spell consumes)", "duration": "Instantaneous", "description": "You touch a creature that has died within the last minute. That creature returns to life with 1 hit point. This spell can’t return to life a creature that has died of old age, nor can it restore any missing body parts."}, {"class": "cleric", "name": "Sending", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "Unlimited", "components": "V, S, M (a short piece of fine copper wire)", "duration": "1 round", "description": "You send a short message of twenty-five words or less to a creature with which you are familiar. The creature hears the message in its mind, recognizes you as the sender if it knows you, and can answer in a like manner immediately. The spell enables creatures with Intelligence scores of at least 1 to understand the meaning of your message."}, {"class": "cleric", "name": "Speak with Dead", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "10 feet", "components": "V, S, M (burning incense)", "duration": "10 minutes", "description": "You grant the semblance of life and intelligence to a corpse of your choice within range, allowing it to answer the questions you pose. The corpse must still have a mouth and can’t be undead. The spell fails if the corpse was the target of this spell within the last 10 days."}, {"class": "cleric", "name": "Spirit Guardians", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "Self (15-foot-radius)", "components": "V, S, M (a holy symbol)", "duration": "Concentration, up to 10 minutes", "description": "You call forth spirits to protect you. They flit around you to a distance of 15 feet for the duration. If you are good or neutral, their spectral form appears angelic or fey (your choice). If you are evil, they appear fiendish."}, {"class": "cleric", "name": "Spirit Shroud", "source": "Tasha's Cauldron of Everything", "level": 3, "casting": "1 bonus action", "range": "Self", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "You call forth spirits of the dead, which flit around you for the spell’s duration. The spirits are intangible and invulnerable."}, {"class": "cleric", "name": "Tongues", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "Touch", "components": "V, M (a small clay model of a ziggurat)", "duration": "1 hour", "description": "This spell grants the creature you touch the ability to understand any spoken language it hears. Moreover, when the target speaks, any creature that knows at least one language and can hear the target understands what it says."}, {"class": "cleric", "name": "Water Walk", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "30 feet", "components": "V, S, M (a piece of cork)", "duration": "1 hour", "description": "This spell grants the ability to move across any liquid surface – such as water, acid, mud, snow, quicksand, or lava – as if it were harmless solid ground (creatures crossing molten lava can still take damage from the heat). Up to ten willing creatures you can see within range gain this ability for the duration."}, {"class": "cleric", "name": "Aura of Life", "source": "Player's Handbook", "level": 4, "casting": "1 action", "range": "Self (30-foot radius)", "components": "V", "duration": "Concentration, up to 10 minutes", "description": "Life-preserving energy radiates from you in an aura with a 30-foot radius. Until the spell ends, the aura moves with you, centered on you. Each non-hostile creature in the aura (including you) has resistance to necrotic damage, and its hit point maximum can’t be reduced. In addition, a non-hostile, living creature regains 1 hit point when it starts its turn in the aura with 0 hit points."}, {"class": "cleric", "name": "Aura of Purity", "source": "Player's Handbook", "level": 4, "casting": "1 action", "range": "Self (30-foot radius)", "components": "V", "duration": "Concentration, up to 10 minutes", "description": "Purifying energy radiates from you in an aura with a 30-foot radius. Until the spell ends, the aura moves with you, centered on you. Each non-hostile creature in the aura (including you) can’t become diseased, has resistance to poison damage, and has advantage on saving throws against effects that cause any of the following conditions: blinded, charmed, deafened, frightened, paralyzed, poisoned, and stunned."}, {"class": "cleric", "name": "Banishment", "source": "Player's Handbook", "level": 4, "casting": "1 action", "range": "60 feet", "components": "V, S, M (an item distasteful to the target)", "duration": "Concentration, up to 1 minute", "description": "You attempt to send one creature that you can see within range to another place of existence. The target must succeed on a Charisma saving throw or be banished."}, {"class": "cleric", "name": "Control Water", "source": "Player's Handbook", "level": 4, "casting": "1 action", "range": "300 feet", "components": "V, S, M (a drop of water and a pinch of dust)", "duration": "Concentration, up to 10 minutes", "description": "Until the spell ends, you control any freestanding water inside an area you choose that is a cube up to 100 feet on a side. You can choose from any of the following effects when you cast this spell. As an action on your turn, you can repeat the same effect or choose a different one."}, {"class": "cleric", "name": "Death Ward", "source": "Player's Handbook", "level": 4, "casting": "1 action", "range": "Touch", "components": "V, S", "duration": "8 hours", "description": "You touch a creature and grant it a measure of protection from death. The first time the target would drop to 0 hit points as a result of taking damage, the target instead drops to 1 hit point, and the spell ends. If the spell is still in effect when the target is subjected to an effect that would kill it instantaneously without dealing damage, that effect is instead negated against the target, and the spells ends."}, {"class": "cleric", "name": "Divination", "source": "Player's Handbook", "level": 4, "casting": "1 action", "range": "Self", "components": "V, S, M (incense and a sacrificial offering appropriate to your religion, together worth at least 25 gp, which the spell consumes)", "duration": "Instantaneous", "description": "Your magic and an offering put you in contact with a god or a god’s servants. You ask a single question concerning a specific goal, event, or activity to occur within 7 days. The DM offers a truthful reply. The reply might be a short phrase, a cryptic rhyme, or an omen."}, {"class": "cleric", "name": "Freedom of Movement", "source": "Player's Handbook", "level": 4, "casting": "1 action", "range": "Touch", "components": "V, S, M (a leather strap, bound around the arm or a similar appendage)", "duration": "1 hour", "description": "You touch a willing creature. For the duration, the target’s movement is unaffected by difficult terrain, and spells and other magical effects can neither reduce the target’s speed nor cause the target to be paralyzed or restrained."}, {"class": "cleric", "name": "Guardian of Faith", "source": "Player's Handbook", "level": 4, "casting": "1 action", "range": "30 feet", "components": "V", "duration": "8 hours", "description": "A Large spectral guardian appears and hovers for the duration in an unoccupied space of your choice that you can see within range. The guardian occupies that space and is indistinct except for a gleaming sword and shield emblazoned with the symbol of your deity."}, {"class": "cleric", "name": "Locate Creature", "source": "Player's Handbook", "level": 4, "casting": "1 action", "range": "Self", "components": "V, S, M (a bit of fur from a bloodhound)", "duration": "Concentration, up to 1 hour", "description": "Describe or name a creature that is familiar to you. You sense the direction to the creature’s location, as long as that creature is within 1,000 feet of you. If the creature is moving, you know the direction of its movement."}, {"class": "cleric", "name": "Stone Shape", "source": "Player's Handbook", "level": 4, "casting": "1 action", "range": "Touch", "components": "V, S, M (soft clay, which must be worked into roughly the desired shape of the stone object)", "duration": "Instantaneous", "description": "You touch a stone object of Medium size or smaller or a section of stone no more than 5 feet in any dimension and form it into any shape that suits your purpose. So, for example, you could shape a large rock into a weapon, idol, or coffer, or make a small passage through a wall, as long as the wall is less than 5 feet thick. You could also shape a stone door or its frame to seal the door shut. The object you create can have up to two hinges and a latch, but finer mechanical detail isn’t possible."}, {"class": "cleric", "name": "Commune", "source": "Player's Handbook", "level": 5, "casting": "1 minute", "range": "Self", "components": "V, S, M (incense and a vial of holy or unholy water)", "duration": "1 minute", "description": "You contact your deity or a divine proxy and ask up to three questions that can be answered with a yes or no. You must ask your questions before the spell ends. You receive a correct answer for each question."}, {"class": "cleric", "name": "Contagion", "source": "Player's Handbook", "level": 5, "casting": "1 action", "range": "Touch", "components": "V, S", "duration": "7 days", "description": "Your touch inflicts disease. Make a melee spell attack against a creature within your reach. On a hit, the target is poisoned."}, {"class": "cleric", "name": "Dawn", "source": "Xanathar's Guide to Everything", "level": 5, "casting": "1 action", "range": "60 feet", "components": "V, S, M (a sunburst pendant worth at least 100 gp)", "duration": "Concentration, up to 1 minute", "description": "The light of dawn shines down on a location you specify within range. Until the spell ends, a 30-foot-radius, 40-foot-high cylinder of bright light glimmers there. This light is sunlight. When the cylinder appears, each creature in it must make a Constitution saving throw, taking 4d10 radiant damage on a failed save, or half as much damage on a successful one. A creature must also make this saving throw whenever it ends its turn in the cylinder. If you’re within 60 feet of the cylinder, you can move it up to 60 feet as a bonus action on your turn."}, {"class": "cleric", "name": "Dispel Evil and Good", "source": "Player's Handbook", "level": 5, "casting": "1 action", "range": "Self", "components": "V, S, M (holy water or powdered silver and iron)", "duration": "Concentration, up to 1 minute", "description": "Shimmering energy surrounds and protects you from fey, undead, and creatures originating from beyond the Material Plane. For the duration, celestials, elementals, fey, fiends, and undead have disadvantage on attack rolls against you. You can end the spell early by using either of the following special functions."}, {"class": "cleric", "name": "Flame Strike", "source": "Player's Handbook", "level": 5, "casting": "1 action", "range": "60 feet", "components": "V, S, M (pinch of sulfur)", "duration": "Instantaneous", "description": "A vertical column of divine fire roars down from the heavens in a location you specify. Each creature in a 10-foot radius, 40-foot-high cylinder centered on a point within range must make a Dexterity saving throw. A creature takes 4d6 fire damage and 4d6 radiant damage on a failed save, or half as much damage on a successful one."}, {"class": "cleric", "name": "Geas", "source": "Player's Handbook", "level": 5, "casting": "1 minute", "range": "60 feet", "components": "V", "duration": "30 days", "description": "You place a magical command on a creature that you can see within range, forcing it to carry out some service or refrain from some action or course of activity as you decide."}, {"class": "cleric", "name": "Greater Restoration", "source": "Player's Handbook", "level": 5, "casting": "1 action", "range": "Touch", "components": "V, S, M (diamond dust worth at least 100 gp, which the spell consumes)", "duration": "Instantaneous", "description": "You imbue a creature you touch with positive energy to undo a debilitating effect. You can reduce the target’s exhaustion level by one, or end one of the following effects on the target:"}, {"class": "cleric", "name": "Hallow", "source": "Player's Handbook", "level": 5, "casting": "24 hours", "range": "Touch", "components": "V, S, M (herbs, oils, and incense worth at least 1,000 gp, which the spell consumes)", "duration": "Until dispelled", "description": "You touch a point and infuse an area around it with holy (or unholy) power. The area can have a radius up to 60 feet, and the spell fails if the radius includes an area already under the effect a hallow spell. The affected area is subject to the following effects."}, {"class": "cleric", "name": "Holy Weapon", "source": "Xanathar's Guide to Everything", "level": 5, "casting": "1 bonus action", "range": "Touch", "components": "V, S", "duration": "Concentration, up to 1 hour", "description": "You imbue a weapon you touch with holy power. Until the spell ends, the weapon emits bright light in a 30-foot radius and dim light for an additional 30 feet. In addition, weapon attacks made with it deal an extra 2d8 radiant damage on a hit. If the weapon isn’t already a magic weapon, it becomes one for the duration. As a bonus action on your turn, you can dismiss this spell and cause the weapon to emit a burst of radiance. Each creature of your choice that you can see within 30 feet of the weapon must make a Constitution saving throw. On a failed save, a creature takes 4d8 radiant damage, and it is blinded for 1 minute. On a successful save, a creature takes half as much damage and isn’t blinded. At the end of each of its turns, a blinded creature can make a Constitution saving throw, ending the effect on itself on a success."}, {"class": "cleric", "name": "Insect Plague", "source": "Player's Handbook", "level": 5, "casting": "1 action", "range": "300 feet", "components": "V, S, M (a few grains of sugar, some kernels of grain, and a smear of fat)", "duration": "Concentration, up to 10 minutes", "description": "Swarming, biting locusts fill a 20-foot-radius sphere centered on a point you choose within range. The sphere spreads around corners. The sphere remains for the duration, and its area is lightly obscured. The sphere’s area is difficult terrain."}, {"class": "cleric", "name": "Legend Lore", "source": "Player's Handbook", "level": 5, "casting": "10 minutes", "range": "Self", "components": "V, S, M (incense worth at least 250 gp, which the spell consumes, and four ivory strips worth at least 50 gp each)", "duration": "Instantaneous", "description": "Name or describe a person, place, or object. The spell brings to your mind a brief summary of the significant lore about the thing you named. The lore might consist of current tales, forgotten stories, or even secret lore that has never been widely known. If the thing you named isn’t of legendary importance, you gain no information. The more information you already have about the thing, the more precise and detailed the information you receive is."}, {"class": "cleric", "name": "Mass Cure Wounds", "source": "Player's Handbook", "level": 5, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "Instantaneous", "description": "A wave of healing energy washes out from a point of your choice within range. Choose up to six creatures in a 30-foot-radius sphere centered on that point. Each target regains hit points equal to 3d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs."}, {"class": "cleric", "name": "Planar Binding", "source": "Player's Handbook", "level": 5, "casting": "1 hour", "range": "60 feet", "components": "V, S, M (a jewel worth at least 1,000 gp, which the spell consumes)", "duration": "24 hours", "description": "With this spell, you attempt to bind a celestial, an elemental, a fey, or a fiend to your service. The creature must be within range for the entire casting of the spell. (Typically, the creature is first summoned into the center of an inverted Magic Circle in order to keep it trapped while this spell is cast.) At the completion of the casting, the target must make a Charisma saving throw. On a failed save, it is bound to serve you for the duration. If the creature was summoned or created by another spell, that spell’s duration is extended to match the duration of this spell."}, {"class": "cleric", "name": "Raise Dead", "source": "Player's Handbook", "level": 5, "casting": "1 hour", "range": "Touch", "components": "V, S, M (a diamond worth at least 500 gp, which the spell consumes)", "duration": "Instantaneous", "description": "You return a dead creature you touch to life, provided that it has been dead no longer than 10 days. If the creature’s soul is both willing and at liberty to rejoin the body, the creature returns to life with 1 hit point."}, {"class": "cleric", "name": "Scrying", "source": "Player's Handbook", "level": 5, "casting": "10 minutes", "range": "Self", "components": "V, S, M (a focus worth at least 1,000 gp, such as a crystal ball, a silver mirror, or a font filled with holy water)", "duration": "Concentration, up to 10 minutes", "description": "You can see and hear a particular creature you choose that is on the same plane of existence as you. The target must make a Wisdom saving throw, which is modified by how well you know the target and the sort of physical connection you have to it. If a target knows you’re casting this spell, it can fail the saving throw voluntarily if it wants to be observed."}, {"class": "cleric", "name": "Summon Celestial", "source": "Tasha's Cauldron of Everything", "level": 5, "casting": "1 action", "range": "90 feet", "components": "V, S, M (a golden reliquary worth at least 500 gp)", "duration": "Concentration, up to 1 hour", "description": "You call forth a celestial spirit. It manifests in an angelic form in an unoccupied space that you can see within range. This corporeal form uses the Celestial Spirit stat block. When you cast the spell, choose Avenger or Defender. Your choice determines the creature’s attack in its stat block. The creature disappears when it drops to 0 hit points or when the spell ends."}, {"class": "cleric", "name": "Blade Barrier", "source": "Player's Handbook", "level": 6, "casting": "1 action", "range": "90 feet", "components": "V, S", "duration": "Concentration, up to 10 minutes", "description": "You create a vertical wall of whirling, razor-sharp blades made of magical energy. The wall appears within range and lasts for the duration. You can make a straight wall up to 100 feet long, 20 feet high, and 5 feet thick, or a ringed wall up to 60 feet in diameter, 20 feet high, and 5 feet thick. The wall provides three-quarters cover to creatures behind it, and its space is difficult terrain."}, {"class": "cleric", "name": "Create Undead", "source": "Player's Handbook", "level": 6, "casting": "1 minute", "range": "10 feet", "components": "V, S, M (one clay pot filled with grave dirt, one clay pot filled with brackish water, and one 150 gp black onyx stone for each corpse)", "duration": "Instantaneous", "description": "You can cast this spell only at night. Choose up to three corpses of Medium or Small humanoids within range. Each corpse becomes a ghoul under your control. The DM has game statistics for these creatures."}, {"class": "cleric", "name": "Find the Path", "source": "Player's Handbook", "level": 6, "casting": "1 minute", "range": "Self", "components": "V, S, M (a set of divinatory tools – such as bones, ivory sticks, cards, teeth, or carved runes – worth 100 gp, and an object from the location you wish to find)", "duration": "Concentration, up to 1 day", "description": "This spell allows you to find the shortest, most direct physical route to a specific fixed location that you are familiar with on the same plane of existence. If you name a destination on another plan of existence, a destination that moves (such as a mobile fortress), or a destination that isn’t specific (such as \"a green dragon’s lair”), the spell fails."}, {"class": "cleric", "name": "Forbiddance", "source": "Player's Handbook", "level": 6, "casting": "10 minutes", "range": "Touch", "components": "V, S, M (a sprinkling of holy water, rare incense, and powdered ruby worth at least 1,000 gp)", "duration": "1 day", "description": "You create a ward against magical travel that protects up to 40,000 square feet of floor space to a height of 30 feet above the floor. For the duration, creatures can’t teleport into the area or use portals, such as those created by the gate spell, to enter the area. The spell proofs the area against planar travel, and therefore prevents creatures from accessing the area by way of the Astral Plane, Ethereal Plane, Feywild, Shadowfell, or the plane shift spell."}, {"class": "cleric", "name": "Harm", "source": "Player's Handbook", "level": 6, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "Instantanous", "description": "You unleash a virulent disease on a creature that you can see within range. The target must make a Constitution saving throw. On a failed save, it takes 14d6 necrotic damage, or half as much damage on a successful save. The damage can’t reduce the target’s hit points below 1. If the target fails the saving throw, its hit point maximum is reduced for 1 hour by an amount equal to the necrotic damage it took. Any effect that removes a disease allows a creature’s hit point maximum to return to normal before that time passes."}, {"class": "cleric", "name": "Heal", "source": "Player's Handbook", "level": 6, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "Instantaneous", "description": "Choose a creature that you can see within range. A surge of positive energy washes through the creature, causing it to regain 70 hit points. The spell also ends blindness, deafness, and any diseases affecting the target. This spell has no effect on constructs or undead."}, {"class": "cleric", "name": "Heroes' Feast", "source": "Player's Handbook", "level": 6, "casting": "10 minutes", "range": "30 feet", "components": "V, S, M (a gem-encrusted bowl worth at least 1,000 gp, which the spell consumes)", "duration": "Instantaneous", "description": "You bring forth a great feast, including magnificent food and drink. The feast takes 1 hour to consume and disappears at the end of that time, and the beneficial effects don’t set in until this hour is over. Up to twelve creatures can partake of the feast."}, {"class": "cleric", "name": "Planar Ally", "source": "Player's Handbook", "level": 6, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "Instantaneous", "description": "You beseech an otherworldly entity for aid. The being must be known to you: a god, a primordial, a demon prince, or some other being of cosmic power. That entity sends a celestial, an elemental, or a fiend loyal to it to aid you, making the creature appear in an unoccupied space within range. If you know a specific creature’s name, you can speak that name when you cast this spell to request that creature, though you might get a different creature anyway (DM’s choice)."}, {"class": "cleric", "name": "Sunbeam", "source": "Player's Handbook", "level": 6, "casting": "1 action", "range": "Self (60-foot line)", "components": "V, S, M (a magnifying glass)", "duration": "Concentration, up to 1 minute", "description": "A beam of brilliant light flashes out from your hand in a 5-foot-wide, 60-foot-line. Each creature in the line must make a Constitution saving throw. On a failed save, a creature takes 6d8 radiant damage and is blinded until your next turn. On a successful save, it takes half as much damage and isn’t blinded by this spell. Undead and oozes have disadvantage on this saving throw."}, {"class": "cleric", "name": "True Seeing", "source": "Player's Handbook", "level": 6, "casting": "1 action", "range": "Touch", "components": "V, S, M (an ointment for the eyes that costs 25 gp; is made from mushroom powder, saffron, and fat; and is consumed by the spell)", "duration": "1 hour", "description": "This spell gives the willing creature you touch the ability to see things as they actually are. For the duration, the creature has truesight, notices secret doors hidden by magic, and can see into the Ethereal Plane, all out to a range of 120 feet."}, {"class": "cleric", "name": "Word of Recall", "source": "Player's Handbook", "level": 6, "casting": "1 action", "range": "5 feet", "components": "V", "duration": "Instantaneous", "description": "You and up to five willing creatures within 5 feet of you instantly teleport to a previously designated sanctuary. You and any creatures that teleport with you appear in the nearest unoccupied space to the spot you designated when you prepared your sanctuary (see below). If you cast this spell without first preparing a sanctuary, the spell has no effect."}, {"class": "cleric", "name": "Conjure Celestial", "source": "Player's Handbook", "level": 7, "casting": "1 minute", "range": "90 feet", "components": "V, S", "duration": "Concentration, up to 1 hour", "description": "You summon a celestial of challenge rating 4 or lower, which appears in an unoccupied space that you can see within range. The celestial disappears when it drops to 0 hit points or when the spell ends."}, {"class": "cleric", "name": "Divine Word", "source": "Player's Handbook", "level": 7, "casting": "1 bonus action", "range": "30 feet", "components": "V", "duration": "Instantaneous", "description": "You utter a divine word, imbued with the power that shaped the world at the dawn of creation. Choose any number of creatures you can see within range. Each creature that can hear you must make a Charisma saving throw. On a failed save, a creature suffers an effect based on its current hit points:"}, {"class": "cleric", "name": "Etherealness", "source": "Player's Handbook", "level": 7, "casting": "1 action", "range": "Self", "components": "V, S", "duration": "Up to 8 hours", "description": "You step into the border regions of the Ethereal Plane, in the area where it overlaps with your current plane. You remain in the Border Ethereal for the duration or until you use your action to dismiss the spell. During this time, you can move in any direction. If you move up or down, every foot of movement costs an extra foot. You can see and hear the plane you originated from, but everything there looks gray, and you can’t see anything more than 60 feet away."}, {"class": "cleric", "name": "Fire Storm", "source": "Player's Handbook", "level": 7, "casting": "1 action", "range": "150 feet", "components": "V, S", "duration": "Instantaneous", "description": "A storm made up of sheets of roaring flame appears in a location you choose within range. The area of the storm consists of up to ten 10-foot cubes, which you can arrange as you wish. Each cube must have at least one face adjacent to the face of another cube. Each creature in the area must make Dexterity saving throw. It takes 7d10 fire damage on a failed save, or half as much damage on a successful one."}, {"class": "cleric", "name": "Plane Shift", "source": "Player's Handbook", "level": 7, "casting": "1 action", "range": "Touch", "components": "V, S, M (a forked, metal rod worth at least 250 gp, attuned to a particular plane of existence)", "duration": "Instantaneous", "description": "You and up to eight willing creatures who link hands in a circle are transported to a different plane of existence. You can specify a target destination in general terms, such as the City of Brass on the Elemental Plane of Fire or the palace of Dispater on the second level of the Nine Hells, and you appear in or near that destination. If you are trying to reach the City of Brass, for example, you might arrive in its Street of Steel, before its Gate of Ashes, or looking at the city from across the Sea of Fire, at the DM’s discretion."}, {"class": "cleric", "name": "Regenerate", "source": "Player's Handbook", "level": 7, "casting": "1 minute", "range": "Touch", "components": "V, S, M (a prayer wheel and holy water)", "duration": "1 hour", "description": "You touch a creature and stimulate its natural healing ability. The target regains 4d8 + 15 hit points. For the duration of the spell, the target regains 1 hit point at the start of each of its turns (10 hit points each minute)."}, {"class": "cleric", "name": "Resurrection", "source": "Player's Handbook", "level": 7, "casting": "1 hour", "range": "Touch", "components": "V, S, M (a diamond worth at least 1,000 gp, which the spell consumes)", "duration": "Instantaneous", "description": "You touch a dead creature that has been dead for no more than a century, that didn’t die of old age, and that isn’t undead. If its soul is free and willing, the target returns to life with all its hit points."}, {"class": "cleric", "name": "Symbol", "source": "Player's Handbook", "level": 7, "casting": "1 minute", "range": "Touch", "components": "V, S, M (mercury, phosphorus, and powdered diamond and opal with a total value of at least 1,000 gp, which the spell consumes)", "duration": "Until dispelled or triggered", "description": "When you cast this spell, you inscribe a harmful glyph either on a surface (such as a section of floor, a wall, or a table) or within an object that can be closed to conceal the glyph (such as a book, a scroll, or a treasure chest). If you choose a surface, the glyph can cover an area of the surface no larger than 10 feet in diameter. If you choose an object, that object must remain in its place; if the object is moved more than 10 feet from where you cast this spell, the glyph is broken, and the spell ends without being triggered."}, {"class": "cleric", "name": "Temple of the Gods", "source": "Xanathar's Guide to Everything", "level": 7, "casting": "1 hour", "range": "120 feet", "components": "V, S, M (a holy symbol worth at least 5 gp)", "duration": "24 hours", "description": "You cause a temple to shimmer into existence on ground you can see within range. The temple must fit within an unoccupied cube of space, up to 120 feet on each side. The temple remains until the spell ends. It is dedicated to whatever god, pantheon, or philosophy is represented by the holy symbol used in the casting."}, {"class": "cleric", "name": "Antimagic Field", "source": "Player's Handbook", "level": 8, "casting": "1 action", "range": "Self (10-foot-radius sphere)", "components": "V, S, M (a pinch of powdered iron or iron filings)", "duration": "Concentration, up to 1 hour", "description": "A 10-foot-radius invisible sphere of antimagic surrounds you. This area is divorced from the magical energy that suffuses the multiverse. Within the sphere, spells can't be cast, summoned creatures disappear, and even magic items become mundane. Until the spell ends, the sphere moves with you, centered on you."}, {"class": "cleric", "name": "Control Weather", "source": "Player's Handbook", "level": 8, "casting": "10 minutes", "range": "Self (5-mile radius)", "components": "V, S, M (burning incense and bits of earth and wood mixed in water)", "duration": "Concentration, Up to 8 hours", "description": "You take control of the weather within 5 miles of you for the duration. You must be outdoors to cast this spell. Moving to a place where you don’t have a clear path to the sky ends the spell early."}, {"class": "cleric", "name": "Earthquake", "source": "Player's Handbook", "level": 8, "casting": "1 action", "range": "500 feet", "components": "V, S, M (a pinch of dirt, a piece of rock, and a lump of clay)", "duration": "Concentration, up to 1 minute", "description": "You create a seismic disturbance at a point on the ground that you can see within range. For the duration, an intense tremor rips through the ground in a 100-foot-radius circle centered on that point and shakes creatures and structures in contact with the ground in that area."}, {"class": "cleric", "name": "Holy Aura", "source": "Player's Handbook", "level": 8, "casting": "1 action", "range": "Self", "components": "V, S, M (a tiny reliquary worth at least 1,000 gp containing a sacred relic, such as a scrap of cloth from a saint’s robe or a piece of parchment from a religious text)", "duration": "Concentration, up to 1 minute", "description": "Divine light washes out from you and coalesces in a soft radiance in a 30-foot radius around you. Creatures of your choice in that radius when you cast this spell shed dim light in a 5-foot radius and have advantage on all saving throws, and other creatures have disadvantage on attack rolls against them until the spell ends. In addition, when a fiend or an undead hits an affected creature with a melee attack, the aura flashes with brilliant light. The attacker must succeed on a Constitution saving throw or be blinded until the spell ends."}, {"class": "cleric", "name": "Sunburst", "source": "Player's Handbook", "level": 8, "casting": "1 action", "range": "150 feet", "components": "V, S, M (fire and a piece of sunstone)", "duration": "Instantaneous", "description": "Brilliant sunlight flashes in a 60-foot radius centered on a point you choose within range. Each creature in that light must make a Constitution saving throw. On a failed save, a creature takes 12d6 radiant damage and is blinded for 1 minute. On a successful save, it takes half as much damage and isn’t blinded by this spell. Undead and oozes have disadvantage on this saving throw."}, {"class": "cleric", "name": "Astral Projection", "source": "Player's Handbook", "level": 9, "casting": "1 hour", "range": "10 feet", "components": "V, S, M (for each creature you affect with this spell, you must provide one jacinth worth at least 1,000 gp and one ornately carved bar of silver worth at least 100 gp, all of which the spell consumes)", "duration": "Special", "description": "You and up to eight willing creatures within range project your astral bodies into the Astral Plane (the spell fails and the casting is wasted if you are already on that plane). The material body you leave behind is unconscious and in a state of suspended animation; it doesn’t need food or air and doesn’t age."}, {"class": "cleric", "name": "Gate", "source": "Player's Handbook", "level": 9, "casting": "1 action", "range": "60 feet", "components": "V, S, M (a diamond worth at least 5,000 gp)", "duration": "Concentration, up to 1 minute", "description": "You conjure a portal linking an unoccupied space you can see within range to a precise location on a different plane of existence. The portal is a circular opening, which you can make 5 to 20 feet in diameter. You can orient the portal in any direction you choose. The portal lasts for the duration."}, {"class": "cleric", "name": "Mass Heal", "source": "Player's Handbook", "level": 9, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "Instantaneous", "description": "A flood of healing energy flows from you into injured creatures around you. You restore up to 700 hit points, divided as you choose among any number of creatures that you can see within range. Creatures healed by this spell are also cured of all diseases and any effect making them blinded or deafened. This spell has no effect on undead or constructs."}, {"class": "cleric", "name": "Power Word: Heal", "source": "Player's Handbook", "level": 9, "casting": "1 action", "range": "Touch", "components": "V, S", "duration": "Instantaneous", "description": "A wave of healing energy washes over a creature you touch. The target regains all its hit points. If the creature is charmed, frightened, paralyzed, or stunned, the condition ends. If the creature is prone, it can use its reaction to stand up. This spell has no effect on undead or constructs."}, {"class": "cleric", "name": "True Resurrection", "source": "Player's Handbook", "level": 9, "casting": "1 hour", "range": "Touch", "components": "V, S, M (a sprinkle of holy water and diamonds worth at least 25,000 gp, which the spell consumes)", "duration": "Instantaneous", "description": "You touch a creature that has been dead for no longer than 200 years and that died for any reason except old age. If the creature’s soul is free and willing, the creature is restored to life with all its hit points."}]