[{"class": "warlock", "name": "Blade Ward", "source": "Player's Handbook", "level": 0, "casting": "1 action", "range": "Self", "components": "V, S", "duration": "1 round", "description": "You extend your hand and trace a sigil of warding in the air. Until the end of your next turn, you have resistance against bludgeoning, piercing, and slashing damage dealt by weapon attacks."}, {"class": "warlock", "name": "Booming Blade", "source": "Tasha's Cauldron of Everything", "level": 0, "casting": "1 action", "range": "Self (5-foot radius)", "components": "S, M (a melee weapon worth at least 1 sp)", "duration": "1 round", "description": "You brandish the weapon used in the spell’s casting and make a melee attack with it against one creature within 5 feet of you. On a hit, the target suffers the weapon attack’s normal effects and then becomes sheathed in booming energy until the start of your next turn. If the target willingly moves 5 feet or more before then, the target takes 1d8 thunder damage, and the spell ends."}, {"class": "warlock", "name": "Chill Touch", "source": "Player's Handbook", "level": 0, "casting": "1 action", "range": "120 feet", "components": "V, S", "duration": "1 round", "description": "You create a ghostly, skeletal hand in the space of a creature within range. Make a ranged spell attack against the creature to assail it with the chill of the grave. On a hit, the target takes 1d8 necrotic damage, and it can’t regain hit points until the start of your next turn. Until then, the hand clings to the target. If you hit an undead target, it also has disadvantage on attack rolls against you until the end of your next turn."}, {"class": "warlock", "name": "Create Bonfire", "source": "Xanathar's Guide to Everything", "level": 0, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "You create a bonfire on ground that you can see within range. Until the spell ends, the bonfire fills a 5-foot cube. Any creature in the bonfire’s space when you cast the spell must succeed on a Dexterity saving throw or take 1d8 fire damage. A creature must also make the saving throw when it enters the bonfire’s space for the first time on a turn or ends its turn there."}, {"class": "warlock", "name": "Eldritch Blast", "source": "Player's Handbook", "level": 0, "casting": "1 action", "range": "120 feet", "components": "V, S", "duration": "Instantaneous", "description": "A beam of crackling energy streaks toward a creature within range. Make a ranged spell attack against the target. On a hit, the target takes 1d10 force damage."}, {"class": "warlock", "name": "Friends", "source": "Player's Handbook", "level": 0, "casting": "1 action", "range": "Self", "components": "S, M (a small amount of makeup applied to the face as this spell is cast)", "duration": "Concentration, up to 1 minute", "description": "For the duration, you have advantage on all Charisma checks directed at one creature of your choice that isn't hostile toward you. When the spell ends, the creature realizes that you used magic to influence its mood and becomes hostile toward you. A creature prone to violence might attack you. Another creature might seek retribution in other ways (at the DM's discretion), depending on the nature of your interaction with it."}, {"class": "warlock", "name": "Frostbite", "source": "Xanathar's Guide to Everything", "level": 0, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "Instantaneous", "description": "You cause numbing frost to form on one creature that you can see within range. The target must make a Constitution saving throw. On a failed save, the target takes 1d6 cold damage, and it has disadvantage on the next weapon attack roll it makes before the end of its next turn."}, {"class": "warlock", "name": "Green-Flame Blade", "source": "Tasha's Cauldron of Everything/Sword Coast Adventurer's Guide", "level": 0, "casting": "1 action", "range": "Self (5-foot radius)", "components": "S, M (a melee weapon worth at least 1 sp)", "duration": "Instantaneous", "description": "You brandish the weapon used in the spell’s casting and make a melee attack with it against one creature within 5 feet of you. On a hit, the target suffers the weapon attack’s normal effects, and you can cause green fire to leap from the target to a different creature of your choice that you can see within 5 feet of it. The second creature takes fire damage equal to your spellcasting ability modifier."}, {"class": "warlock", "name": "Infestation", "source": "Xanathar's Guide to Everything", "level": 0, "casting": "1 action", "range": "30 feet", "components": "V, S, M (a living flea)", "duration": "Instantaneous", "description": "You cause a cloud of mites, fleas, and other parasites to appear momentarily on one creature you can see within range. The target must succeed on a Constitution saving throw, or it takes 1d6 poison damage and moves 5 feet in a random direction if it can move and its speed is at least 5 feet. Roll a d4 for the direction: 1, north; 2, south; 3, east; or 4, west. This movement doesn’t provoke opportunity attacks, and if the direction rolled is blocked, the target doesn't move."}, {"class": "warlock", "name": "Lightning Lure", "source": "Tasha's Cauldron of Everything", "level": 0, "casting": "1 action", "range": "Self (15-foot radius)", "components": "V", "duration": "Instantaneous", "description": "You create a lash of lightning energy that strikes at one creature of your choice that you can see within 15 feet of you. The target must succeed on a Strength saving throw or be pulled up to 10 feet in a straight line toward you and then take 1d8 lightning damage if it is within 5 feet of you."}, {"class": "warlock", "name": "Mage Hand", "source": "Player's Handbook", "level": 0, "casting": "1 action", "range": "30 feet", "components": "V, S", "duration": "1 minute", "description": "A spectral, floating hand appears at a point you choose within range. The hand lasts for the duration or until you dismiss it as an action. The hand vanishes if it is ever more than 30 feet away from you or if you cast this spell again."}, {"class": "warlock", "name": "Magic Stone", "source": "Xanathar's Guide to Everything/Elemental Evil Player's Companion", "level": 0, "casting": "1 bonus action", "range": "Touch", "components": "V, S", "duration": "1 minute", "description": "You touch one to three pebbles and imbue them with magic. You or someone else can make a ranged spell attack with one of the pebbles by throwing it or hurling it with a sling. If thrown, it has a range of 60 feet. If someone else attacks with the pebble, that attacker adds your spellcasting ability modifier, not the attacker’s, to the attack roll. On a hit, the target takes bludgeoning damage equal to 1d6 + your spellcasting ability modifier. Hit or miss, the spell then ends on the stone."}, {"class": "warlock", "name": "Mind Sliver", "source": "Tasha's Cauldron of Everything", "level": 0, "casting": "1 action", "range": "60 feet", "components": "V", "duration": "1 round", "description": "You drive a disorienting spike of psychic energy into the mind of one creature you can see within range. The target must succeed on an Intelligence saving throw or take 1d6 psychic damage and subtract 1d4 from the next saving throw it makes before the end of your next turn."}, {"class": "warlock", "name": "Minor Illusion", "source": "Player's Handbook", "level": 0, "casting": "1 action", "range": "30 feet", "components": "S, M (a bit of fleece)", "duration": "1 minute", "description": "You create a sound or an image of an object within range that lasts for the duration. The illusion also ends if you dismiss it as an action or cast this spell again."}, {"class": "warlock", "name": "Poison Spray", "source": "Player's Handbook", "level": 0, "casting": "1 action", "range": "10 feet", "components": "V, S", "duration": "Instantaneous", "description": "You extend your hand toward a creature you can see within range and project a puff of noxious gas from your palm. The creature must succeed on a Constitution saving throw or take 1d12 poison damage."}, {"class": "warlock", "name": "Prestidigitation", "source": "Player's Handbook", "level": 0, "casting": "1 action", "range": "10 feet", "components": "V, S", "duration": "Up to 1 hour", "description": "This spell is a minor magical trick that novice spellcasters use for practice. You create one of the following magical effects within range:"}, {"class": "warlock", "name": "Sword Burst", "source": "Tasha's Cauldron of Everything", "level": 0, "casting": "1 action", "range": "Self (5-foot radius)", "components": "V", "duration": "Instantaneous", "description": "You create a momentary circle of spectral blades that sweep around you. All other creatures within 5 feet of you must succeed on a Dexterity saving throw or take 1d6 force damage."}, {"class": "warlock", "name": "Thunderclap", "source": "Xanathar's Guide to Everything", "level": 0, "casting": "1 action", "range": "Self (5-foot radius)", "components": "S", "duration": "Instantaneous", "description": "You create a burst of thunderous sound, which can be heard 100 feet away. Each creature other than you within 5 feet of you must make a Constitution saving throw. On a failed save, the creature takes 1d6 thunder damage."}, {"class": "warlock", "name": "Toll the Dead", "source": "Xanathar's Guide to Everything", "level": 0, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "Instantaneous", "description": "You point at one creature you can see within range, and the sound of a dolorous bell fills the air around it for a moment. The target must succeed on a Wisdom saving throw or take 1d8 necrotic damage. If the target is missing any of its hit points, it instead takes 1d12 necrotic damage."}, {"class": "warlock", "name": "True Strike", "source": "Player's Handbook", "level": 0, "casting": "1 action", "range": "30 feet", "components": "S", "duration": "Concentration, up to 1 round", "description": "You extend your hand and point a finger at a target in range. Your magic grants you a brief insight into the target’s defenses. On your next turn, you gain advantage on your first attack roll against the target, provided that this spell hasn’t ended."}, {"class": "warlock", "name": "Armor of Agathys", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "Self", "components": "V, S, M (a cup of water)", "duration": "1 hour", "description": "A protective magical force surrounds you, manifesting as a spectral frost that covers you and your gear. You gain 5 temporary hit points for the duration. If a creature hits you with a melee attack while you have these hit points, the creature takes 5 cold damage."}, {"class": "warlock", "name": "Arms of Hadar", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "Self (10-foot radius)", "components": "V, S", "duration": "Instantaneous", "description": "You invoke the power of Hadar, the Dark Hunger. Tendrils of dark energy erupt from you and batter all creatures within 10 feet of you. Each creature in that area must make a Strength saving throw. On a failed save, a target takes 2d6 necrotic damage and can’t take reactions until its next turn. On a successful save, the creature takes half damage, but suffers no other effect."}, {"class": "warlock", "name": "Cause Fear", "source": "Xanathar's Guide to Everything", "level": 1, "casting": "1 action", "range": "60 feet", "components": "V", "duration": "Concentration, up to 1 minute", "description": "You awaken the sense of mortality in one creature you can see within range. A construct or an undead is immune to this effect. The target must succeed on a Wisdom saving throw or become frightened of you until the spell ends. The frightened target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."}, {"class": "warlock", "name": "Charm Person", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "30 feet", "components": "V, S", "duration": "1 hour", "description": "You attempt to charm a humanoid you can see within range. It must make a Wisdom saving throw, and does so with advantage if you or your companions are fighting it. If it fails the saving throw, it is charmed by you until the spell ends or until you or your companions do anything harmful to it. The charmed creature regards you as a friendly acquaintance. When the spell ends, the creature knows it was charmed by you."}, {"class": "warlock", "name": "Comprehend Languages", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "Self", "components": "V, S, M (a pinch of soot and salt)", "duration": "1 hour", "description": "For the duration, you understand the literal meaning of any spoken language that you hear. You also understand any written language that you see, but you must be touching the surface on which the words are written. It takes about 1 minute to read one page of text."}, {"class": "warlock", "name": "Distort Value", "source": "Acquisitions Inc.", "level": 1, "casting": "1 minute", "range": "Touch", "components": "V", "duration": "8 hours", "description": "You cast this spell on an object no more than 1 foot on a side, doubling the object's perceived value by adding illusionary flourish or reducing its perceived value by half with the help of illusionary dents and scratches. Anyone examining the object must roll an Investigation check against your spell DC."}, {"class": "warlock", "name": "Expeditious Retreat", "source": "Player's Handbook", "level": 1, "casting": "1 bonus action", "range": "Self", "components": "V, S", "duration": "Concentration, up to 10 minutes", "description": "This spell allows you to move at an incredible pace. When you cast this spell, and then as a bonus action on each of your turns until the spell ends, you can take the Dash action."}, {"class": "warlock", "name": "Hellish Rebuke", "source": "Player's Handbook", "level": 1, "casting": "1 reaction, which you take when you are damaged by a creature within 60 feet of you that you can see", "range": "60 feet", "components": "V, S", "duration": "Instantaneous", "description": "You point your finger, and the creature that damaged you is momentarily surrounded by hellish flames. The creature must make a Dexterity saving throw. It takes 2d10 fire damage on a failed save, or half as much damage on a successful one."}, {"class": "warlock", "name": "Hex", "source": "Player's Handbook", "level": 1, "casting": "1 bonus action", "range": "90 feet", "components": "V, S, M (the petrified eye of a newt)", "duration": "Concentration, up to 1 hour", "description": "You place a curse on a creature that you can see within range. Until the spell ends, you deal an extra 1d6 necrotic damage to the target whenever you hit it with an attack. Also, choose one ability when you cast the spell. The target has disadvantage on ability checks made with the chosen ability."}, {"class": "warlock", "name": "Illusory Script", "source": "Player's Handbook", "level": 1, "casting": "1 minute", "range": "Touch", "components": "S, M (a lead-based ink worth at least 10 gp, which the spell consumes)", "duration": "10 days", "description": "You write on parchment, paper, or some other suitable writing material and imbue it with a potent illusion that lasts for the duration."}, {"class": "warlock", "name": "Protection from Evil and Good", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "Touch", "components": "V, S, M (holy water or powdered silver and iron, which the spell consumes)", "duration": "Concentration, up to 10 minutes", "description": "Until the spell ends, one willing creature you touch is protected against certain types of creatures: aberrations, celestials, elementals, fey, fiends, and undead."}, {"class": "warlock", "name": "Unseen Servant", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "60 feet", "components": "V, S, M (a piece of string and a bit of wood)", "duration": "1 hour", "description": "This spell creates an invisible, mindless, shapeless, Medium force that performs simple tasks at your command until the spell ends. The servant springs into existence in an unoccupied space on the ground within range. It has AC 10, 1 hit point, and a Strength of 2, and it can’t attack. If it drops to 0 hit points, the spell ends."}, {"class": "warlock", "name": "Witch Bolt", "source": "Player's Handbook", "level": 1, "casting": "1 action", "range": "30 feet", "components": "V, S, M (a twig from a tree that has been struck by lightning)", "duration": "Concentration, up to 1 minute", "description": "A beam of crackling, blue energy lances out toward a creature within range, forming a sustained arc of lightning between you and the target. Make a ranged spell attack against that creature. On a hit, the target takes 1d12 lightning damage, and on each of your turns for the duration, you can use your action to deal 1d12 lightning damage to the target automatically. The spell ends if you use your action to do anything else. The spell also ends if the target is ever outside the spell’s range or if it has total cover from you."}, {"class": "warlock", "name": "Borrowed Knowledge", "source": "Strixhaven", "level": 2, "casting": "1 action", "range": "Self", "components": "V, S, M (a book worth at least 25 gp)", "duration": "1 hour", "description": "You draw on knowledge from spirits of the past. Choose one skill in which you lack proficiency. For the spell's duration, you have proficiency in the chosen skill. The spell ends early if you cast it again."}, {"class": "warlock", "name": "Cloud of Daggers", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "60 feet", "components": "V, S, M (a sliver of glass)", "duration": "Concentration, up to 1 minute", "description": "You fill the air with spinning daggers in a cube 5 feet on each side, centered on a point you choose within range. A creature takes 4d4 slashing damage when it enters the spell’s area for the first time on a turn or starts its turn there."}, {"class": "warlock", "name": "Crown of Madness", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "120 feet", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "One humanoid of your choice that you can see within range must succeed on a Wisdom saving throw or become charmed by you for the duration. While the target is charmed in this way, a twisted crown of jagged iron appears on its head, and a madness glows in its eyes."}, {"class": "warlock", "name": "Darkness", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "60 feet", "components": "V, M (bat fur and a drop of pitch or piece of coal)", "duration": "Concentration, up to 10 minutes", "description": "Magical darkness spreads from a point you choose within range to fill a 15-foot radius sphere for the duration. The darkness spreads around corners. A creature with darkvision can’t see through this darkness, and nonmagical light can’t illuminate it."}, {"class": "warlock", "name": "Earthbind", "source": "Xanathar's Guide to Everything", "level": 2, "casting": "1 action", "range": "300 feet", "components": "V", "duration": "Concentration, up to 1 minute", "description": "Choose one creature you can see within range. Yellow strips of magical energy loop around the creature. The target must succeed on a Strength saving throw or its flying speed (if any) is reduced to 0 feet for the spell’s duration. An airborne creature affected by this spell descends at 60 feet per round until it reaches the ground or the spell ends."}, {"class": "warlock", "name": "Enthrall", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "1 minute", "description": "You weave a distracting string of words, causing creatures of your choice that you can see within range and that can hear you to make a Wisdom saving throw. Any creature that can’t be charmed succeeds on this saving throw automatically, and if you or your companions are fighting a creature, it has advantage on the save. On a failed save, the target has disadvantage on Wisdom (Perception) checks made to perceive any creature other than you until the spell ends or until the target can no longer hear you. The spell ends if you are incapacitated or can no longer speak."}, {"class": "warlock", "name": "Flock of Familiars", "source": "Lost Laboratory of Kwalish", "level": 2, "casting": "1 minute", "range": "Touch", "components": "V, S", "duration": "Concentration, up to 1 hour", "description": "You temporarily summon three familiars – spirits that take animal forms of your choice. Each familiar uses the same rules and options for a familiar conjured by the Find Familiar spell. All the familiars conjured by this spell must be the same type of creature (celestials, fey, or fiends; your choice). If you already have a familiar conjured by the Find Familiar spell or similar means, then one fewer familiars are conjured by this spell."}, {"class": "warlock", "name": "Hold Person", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "60 feet", "components": "V, S, M (a small, straight piece of iron)", "duration": "Concentration, up to 1 minute", "description": "Choose a humanoid that you can see within range. The target must succeed on a Wisdom saving throw or be paralyzed for the duration. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the spell ends on the target."}, {"class": "warlock", "name": "Invisibility", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "Touch", "components": "V, S, M (an eyelash encased in gum arabic)", "duration": "Concentration, up to 1 hour", "description": "A creature you touch becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target’s person. The spell ends for a target that attacks or casts a spell."}, {"class": "warlock", "name": "Mind Spike", "source": "Xanathar's Guide to Everything", "level": 2, "casting": "1 action", "range": "60 feet", "components": "S", "duration": "Concentration, up to 1 hour", "description": "You reach into the mind of one creature you can see within range. The target must make a Wisdom saving throw, taking 3d8 psychic damage on a failed save, or half as much damage on a successful one. On a failed save, you also always know the target's location until the spell ends, but only while the two of you are on the same plane of existence. While you have this knowledge, the target can’t become hidden from you, and if it’s invisible, it gains no benefit from that condition against you."}, {"class": "warlock", "name": "Mirror Image", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "Self", "components": "V, S", "duration": "1 minute", "description": "Three illusory duplicates of yourself appear in your space. Until the spell ends, the duplicates move with you and mimic your actions, shifting position so it’s impossible to track which image is real. You can use your action to dismiss the illusory duplicates."}, {"class": "warlock", "name": "Misty Step", "source": "Player's Handbook", "level": 2, "casting": "1 bonus action", "range": "Self", "components": "V", "duration": "Instantaneous", "description": "Briefly surrounded by silvery mist, you teleport up to 30 feet to an unoccupied space that you can see."}, {"class": "warlock", "name": "Ray of Enfeeblement", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "A black beam of enervating energy springs from your finger toward a creature within range. Make a ranged spell attack against the target. On a hit, the target deals only half damage with weapon attacks that use Strength until the spell ends."}, {"class": "warlock", "name": "Shadow Blade", "source": "Xanathar's Guide to Everything", "level": 2, "casting": "1 bonus action", "range": "Self", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "You weave together threads of shadow to create a sword of solidified gloom in your hand. This magic sword lasts until the spell ends. It counts as a simple melee weapon with which you are proficient. It deals 2d8 psychic damage on a hit and has the finesse, light, and thrown properties (range 20/60). In addition, when you use the sword to attack a target that is in dim light or darkness, you make the attack roll with advantage."}, {"class": "warlock", "name": "Shatter", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "60 feet", "components": "V, S, M (a chip of mica)", "duration": "Instantaneous", "description": "A sudden loud ringing noise, painfully intense, erupts from a point of your choice within range. Each creature in a 10-foot-radius sphere centered on that point must make a Constitution saving throw. A creature takes 3d8 thunder damage on a failed save, or half as much damage on a successful one. A creature made of inorganic material such as stone, crystal, or metal has disadvantage on this saving throw."}, {"class": "warlock", "name": "Spider Climb", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "Touch", "components": "V, S, M (a drop of bitumen and a spider)", "duration": "Concentration, up to 1 hour", "description": "Until the spell ends, one willing creature you touch gains the ability to move up, down, and across vertical surfaces and upside down along ceilings, while leaving its hands free. The target also gains a climbing speed equal to its walking speed."}, {"class": "warlock", "name": "Suggestion", "source": "Player's Handbook", "level": 2, "casting": "1 action", "range": "30 feet", "components": "V, M (a snake’s tongue and either a bit of honeycomb or a drop of sweet oil)", "duration": "Concentration, up to 8 hours", "description": "You suggest a course of activity (limited to a sentence or two) and magically influence a creature you can see within range that can hear and understand you. Creatures that can’t be charmed are immune to this effect. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to stab itself, throw itself onto a spear, immolate itself, or do some other obviously harmful act ends the spell."}, {"class": "warlock", "name": "Counterspell", "source": "Player's Handbook", "level": 3, "casting": "1 reaction, which you take when you see a creature within 60 feet of you casting a spell", "range": "60 feet", "components": "S", "duration": "Instantaneous", "description": "You attempt to interrupt a creature in the process of casting a spell. If the creature is casting a spell of 3rd level or lower, its spell fails and has no effect. If it is casting a spell of 4th level or higher, make an ability check using your spellcasting ability. The DC equals 10 + the spell’s level. On a success, the creature’s spell fails and has no effect."}, {"class": "warlock", "name": "Dispel Magic", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "120 feet", "components": "V, S", "duration": "Instantaneous", "description": "Choose any creature, object, or magical effect within range. Any spell of 3rd level or lower on the target ends. For each spell of 4th level or higher on the target, make an ability check using your spellcasting ability. The DC equals 10 + the spell's level. On a successful check, the spell ends."}, {"class": "warlock", "name": "Enemies Abound", "source": "Xanathar's Guide to Everything", "level": 3, "casting": "1 action", "range": "120 feet", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "You reach into the mind of one creature you can see and force it to make an Intelligence saving throw. A creature automatically succeeds if it is immune to being frightened. On a failed save, the target loses the ability to distinguish friend from foe, regarding all creatures it can see as enemies until the spell ends. Each time the target takes damage, it can repeat the saving throw, ending the effect on itself on a success."}, {"class": "warlock", "name": "Fear", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "Self (30-foot cone)", "components": "V, S, M (a white feather or the heart of a hen)", "duration": "Concentration, up to 1 minute", "description": "You project a phantasmal image of a creature’s worst fears. Each creature in a 30-foot cone must succeed on a Wisdom saving throw or drop whatever it is holding and become frightened for the duration."}, {"class": "warlock", "name": "Fly", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "Touch", "components": "V, S, M (a wing feather from any bird)", "duration": "Concentration, up to 10 minutes", "description": "You touch a willing creature. The target gains a flying speed of 60 feet for the duration. When the spell ends, the target falls if it is still aloft, unless it can stop the fall."}, {"class": "warlock", "name": "Gaseous Form", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "Touch", "components": "V, S, M (a bit of gauze and a wisp of smoke)", "duration": "Concentration, up to 1 hour", "description": "You transform a willing creature you touch, along with everything it’s wearing and carrying, into a misty cloud for the duration. The spell ends if the creature drops to 0 hit points. An incorporeal creature isn’t affected."}, {"class": "warlock", "name": "Hunger Of Hadar", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "150 feet", "components": "V, S, M (a pickled octopus tentacle)", "duration": "Concentration, up to 1 minute", "description": "You open a gateway to the dark between the stars, a region infested with unknown horrors. A 20-foot-radius sphere of blackness and bitter cold appears, centered on a point with range and lasting for the duration. This void is filled with a cacophony of soft whispers and slurping noises that can be heard up to 30 feet away. No light, magical or otherwise, can illuminate the area, and creatures fully within the area are blinded."}, {"class": "warlock", "name": "Hypnotic Pattern", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "120 feet", "components": "S, M (a glowing stick of incense or a crystal vial filled with phosphorescent material)", "duration": "Concentration, up to 1 minute", "description": "You create a twisting pattern of colors that weaves through the air inside a 30-foot cube within range. The pattern appears for a moment and vanishes. Each creature in the area who sees the pattern must make a Wisdom saving throw. On a failed save, the creature becomes charmed for the duration. While charmed by this spell, the creature is incapacitated and has a speed of 0."}, {"class": "warlock", "name": "Incite Greed", "source": "Acquisitions Inc.", "level": 3, "casting": "1 action", "range": "30 feet", "components": "V, S, M (a gem worth at least 50 gp)", "duration": "Concentration, up to 1 minute", "description": "When you cast this spell, you present the gem used as the material component and choose any number of creatures within range that can see you. Each target must succeed on a Wisdom saving throw or be charmed by you until the spell ends, or until you or your companions do anything harmful to it. While charmed in this way, a creature can do nothing but use its movement to approach you in a safe manner. While an affected creature is within 5 feel of you, it cannot move, but simply stares greedily at the gem you present."}, {"class": "warlock", "name": "Intellect Fortress", "source": "Tasha's Cauldron of Everything", "level": 3, "casting": "1 action", "range": "30 feet", "components": "V", "duration": "Concentration, up to 1 hour", "description": "For the duration, you or one willing creature you can see within range has resistance to psychic damage, as well as advantage on Intelligence, Wisdom, and Charisma saving throws."}, {"class": "warlock", "name": "Magic Circle", "source": "Player's Handbook", "level": 3, "casting": "1 minute", "range": "10 feet", "components": "V, S, M (holy water or powdered silver and iron worth at least 100 gp, which the spell consumes)", "duration": "1 hour", "description": "You create a 10-foot-radius, 20-foot-tall cylinder of magical energy centered on a point on the ground that you can see within range. Glowing runes appear wherever the cylinder intersects with the floor or other surface."}, {"class": "warlock", "name": "Major Image", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "120 feet", "components": "V, S, M (a bit of fleece)", "duration": "Concentration, up to 10 minutes", "description": "You create the image of an object, a creature, or some other visible phenomenon that is no larger than a 20-foot cube. The image appears at a spot that you can see within range and lasts for the duration. It seems completely real, including sounds, smells, and temperature appropriate to the thing depicted. You can’t create sufficient heat or cold to cause damage, a sound loud enough to deal thunder damage or deafen a creature, or a smell that might sicken a creature (like a troglodyte’s stench)."}, {"class": "warlock", "name": "Remove Curse", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "Touch", "components": "V, S", "duration": "Instantaneous", "description": "At your touch, all curses affecting one creature or object end. If the object is a cursed magic item, its curse remains, but the spell breaks its owner’s attunement to the object so it can be removed or discarded."}, {"class": "warlock", "name": "Spirit Shroud", "source": "Tasha's Cauldron of Everything", "level": 3, "casting": "1 bonus action", "range": "Self", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "You call forth spirits of the dead, which flit around you for the spell’s duration. The spirits are intangible and invulnerable."}, {"class": "warlock", "name": "Summon Fey", "source": "Tasha's Cauldron of Everything", "level": 3, "casting": "1 action", "range": "90 feet", "components": "V, S, M (a gilded flower worth at least 300 gp)", "duration": "Concentration, up to 1 hour", "description": "You call forth a fey spirit. It manifests in an unoccupied space that you can see within range. This corporeal form uses the Fey Spirit stat block. When you cast the spell, choose a mood. Fuming, Mirthful, or Tricksy. The creature resembles a fey creature of your choice marked by the chosen mood, which determines one of the traits in its stat block. The creature disappears when it drops to 0 hit points or when the spell ends."}, {"class": "warlock", "name": "Summon Lesser Demons", "source": "Xanathar's Guide to Everything", "level": 3, "casting": "1 action", "range": "60 feet", "components": "V, S, M (a vial of blood from a humanoid killed within the past 24 hours)", "duration": "Concentration, up to 1 hour", "description": "You utter foul words, summoning demons from the chaos of the Abyss. Roll on the following table to determine what appears."}, {"class": "warlock", "name": "Summon Shadowspawn", "source": "Tasha's Cauldron of Everything", "level": 3, "casting": "1 action", "range": "90 feet", "components": "V, S, M (tears inside a crystal vial worth at least 300 gp)", "duration": "Concentration, up to 1 hour", "description": "You call forth a shadowy spirit. It manifests in an unoccupied space that you can see within range. This corporeal form uses the Shadow Spirit stat block. When you cast the spell, choose an emotion: Fury, Despair, or Fear. The creature resembles a misshapen biped marked by the chosen emotion, which determines certain traits in its stat block. The creature disappears when it drop to 0 hit points or when the spell ends."}, {"class": "warlock", "name": "Summon Undead", "source": "Tasha's Cauldron of Everything", "level": 3, "casting": "1 action", "range": "90 feet", "components": "V, S, M (a gilded skull worth at least 300 gp)", "duration": "Concentration, up to 1 hour", "description": "You call forth an undead spirit. It manifests in an unoccupied space that you can see within range. This corporeal form uses the Undead Spirit stat block. When you cast the spell, choose the creature’s form: Ghostly, Putrid, or Skeletal. The spirit resembles an undead creature with the chosen form, which determines certain traits in its stat block. The creature disappears when it drops to 0 hit points or when the spell ends."}, {"class": "warlock", "name": "Thunder Step", "source": "Xanathar's Guide to Everything", "level": 3, "casting": "1 action", "range": "90 ft", "components": "V", "duration": "Instantaneous", "description": "You teleport yourself to an unoccupied space you can see within range. Immediately after you disappear, a thunderous boom sounds, and each creature within 10 feet of the space you left must make a Constitution saving throw, taking 3d10 thunder damage on a failed save, or half as much damage on a successful one. The thunder can be heard from up to 300 feet away."}, {"class": "warlock", "name": "Tongues", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "Touch", "components": "V, M (a small clay model of a ziggurat)", "duration": "1 hour", "description": "This spell grants the creature you touch the ability to understand any spoken language it hears. Moreover, when the target speaks, any creature that knows at least one language and can hear the target understands what it says."}, {"class": "warlock", "name": "Vampiric Touch", "source": "Player's Handbook", "level": 3, "casting": "1 action", "range": "Self", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "The touch of your shadow-wreathed hand can siphon force from others to heal your wounds. Make a melee spell attack against a creature within your reach. On a hit, the target takes 3d6 necrotic damage, and you regain hit points equal to half the amount of necrotic damage dealt. Until the spell ends, you can make the attack again on each of your turns as an action."}, {"class": "warlock", "name": "Banishment", "source": "Player's Handbook", "level": 4, "casting": "1 action", "range": "60 feet", "components": "V, S, M (an item distasteful to the target)", "duration": "Concentration, up to 1 minute", "description": "You attempt to send one creature that you can see within range to another place of existence. The target must succeed on a Charisma saving throw or be banished."}, {"class": "warlock", "name": "Blight", "source": "Player's Handbook", "level": 4, "casting": "1 action", "range": "30 feet", "components": "V, S", "duration": "Instantaneous", "description": "Necromantic energy washes over a creature of your choice that you can see within range, draining moisture and vitality from it. The target must make a Constitution saving throw. The target takes 8d8 necrotic damage on a failed save, or half as much damage on a successful one. This spell has no effect on undead or constructs."}, {"class": "warlock", "name": "Charm Monster", "source": "Xanathar's Guide to Everything", "level": 4, "casting": "1 action", "range": "30 feet", "components": "V, S", "duration": "1 hour", "description": "You attempt to charm a creature you can see within range. It must make a Wisdom saving throw, and it does so with advantage if you or your companions are fighting it. If it fails the saving throw, it is charmed by you until the spell ends or until you or your companions do anything harmful to it. The charmed creature is friendly to you. When the spell ends, the creature knows it was charmed by you."}, {"class": "warlock", "name": "Dimension Door", "source": "Player's Handbook", "level": 4, "casting": "1 action", "range": "500 feet", "components": "V", "duration": "Instantaneous", "description": "You teleport yourself from your current location to any other spot within range. You arrive at exactly the spot desired. It can be a place you can see, one you can visualize, or one you can describe by stating distance and direction, such as \"200 feet straight downward\" or \"upward to the northwest at a 45-degree angle, 300 feet\"."}, {"class": "warlock", "name": "Elemental Bane", "source": "Xanathar's Guide to Everything", "level": 4, "casting": "1 action", "range": "90 feet", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "Choose one creature you can see within range, and choose one of the following damage types: acid, cold, fire, lightning, or thunder. The target must succeed on a Constitution saving throw or be affected by the spell for its duration. The first time each turn the affected target takes damage of the chosen type, the target takes an extra 2d6 damage of that type. Moreover, the target loses any resistance to that damage type until the spell ends."}, {"class": "warlock", "name": "Galder's Speedy Courier", "source": "Lost Laboratory of Kwalish", "level": 4, "casting": "1 action", "range": "10 feet", "components": "V, S, M (25 gold pieces, or mineral goods of equivalent value, which the spell consumes)", "duration": "10 minutes", "description": "You summon a Small air elemental to a spot within range. The air elemental is formless, nearly transparent, immune to all damage, and cannot interact with other creatures or objects. It carries an open, empty chest whose interior dimensions are 3 feet on each side. While the spell lasts, you can deposit as many items inside the chest as will fit. You can then name a living creature you have met and seen at least once before, or any creature for which you possess a body part, lock of hair, clipping from a nail, or similar portion of the creature’s body."}, {"class": "warlock", "name": "Hallucinatory Terrain", "source": "Player's Handbook", "level": 4, "casting": "10 minutes", "range": "300 feet", "components": "V, S, M (a stone, a twig, and a bit of green plant)", "duration": "24 hours", "description": "You make natural terrain in a 150-foot cube in range look, sound, and smell like some other sort of natural terrain. Thus, open fields or a road can be made to resemble a swamp, hill, crevasse, or some other difficult or impassable terrain. A pond can be made to seem like a grassy meadow, a precipice like a gentle slope, or a rock-strewn gully like a wide and smooth road. Manufactured structures, equipment, and creatures within the area aren’t changed in appearance."}, {"class": "warlock", "name": "Raulothim's Psychic Lance", "source": "Fizban's Treasury of Dragons", "level": 4, "casting": "1 Action", "range": "120ft", "components": "V", "duration": "Instantaneous", "description": "You unleash a shimmering lance of psychic power from your forehead at a creature that you can see within range. Alternatively, you can utter a creature’s name. If the named target is within range, it becomes the spell’s target even if you can’t see it. If the named target isn’t within range, the lance dissipates without effect."}, {"class": "warlock", "name": "Shadow Of Moil", "source": "Xanathar's Guide to Everything", "level": 4, "casting": "1 action", "range": "Self", "components": "V, S, M (an undead eyeball encased in a gem worth at least 150 gp)", "duration": "Concentration, up to 1 minute", "description": "Flame-like shadows wreathe your body until the spell ends, causing you to become heavily obscured to others. The shadows turn dim light within 10 feet of you into darkness, and bright light in the same area to dim light."}, {"class": "warlock", "name": "Sickening Radiance", "source": "Xanathar's Guide to Everything", "level": 4, "casting": "1 action", "range": "120 feet", "components": "V, S", "duration": "Concentration, up to 10 minutes", "description": "Dim, greenish light spreads within a 30-foot-radius sphere centered on a point you choose within range. The light spreads around corners, and it lasts until the spell ends."}, {"class": "warlock", "name": "Summon Aberration", "source": "Tasha's Cauldron of Everything", "level": 4, "casting": "1 action", "range": "90 feet", "components": "V, S, M (a pickled tentacle and an eyeball in a platinum inlaid vial worth at least 400 gp)", "duration": "Concentration, up to 1 hour", "description": "You call forth an aberrant spirit. It manifests in an unoccupied space that you can see within range. This corporeal form uses the Aberrant Spirit stat block. When you cast the spell, choose Beholderkin, Slaad, or Star Spawn. The creature resembles an aberration of that kind, which determines certain traits in its stat block. The creature disappears when it drops to 0 hit points or when the spell ends."}, {"class": "warlock", "name": "Summon Greater Demon", "source": "Xanathar's Guide to Everything", "level": 4, "casting": "1 action", "range": "60 feet", "components": "V, S, M (a vial of blood from a humanoid killed within the past 24 hours)", "duration": "Concentration, up to 1 hour", "description": "You utter foul words, summoning one demon from the chaos of the Abyss. You choose the demon’s type, which must be one of challenge rating 5 or lower, such as a shadow demon or a barlgura. The demon appears in an unoccupied space you can see within range, and the demon disappears when it drops to 0 hit points or when the spell ends."}, {"class": "warlock", "name": "Contact Other Plane", "source": "Player's Handbook", "level": 5, "casting": "1 minute", "range": "Self", "components": "V", "duration": "1 minute", "description": "You mentally contact a demigod, the spirit of a long-dead sage, or some other mysterious entity from another plane. Contacting this extraplanar intelligence can strain or even break your mind. When you cast this spell, make a DC 15 Intelligence saving throw. On a failure, you take 6d6 psychic damage and are insane until you finish a long rest. While insane, you can’t take actions, can’t understand what other creatures say, can’t read, and speak only in gibberish. A Greater Restoration spell cast on you ends this effect."}, {"class": "warlock", "name": "Danse Macabre", "source": "Xanathar's Guide to Everything", "level": 5, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "Concentration, up to 1 hour", "description": "Threads of dark power leap from your fingers to pierce up to five Small or Medium corpses you can see within range. Each corpse immediately stands up and becomes undead. You decide whether it is a zombie or a skeleton (the statistics for zombies and skeletons are in the Monster Manual), and it gains a bonus to its attack and damage rolls equal to your spellcasting ability modifier. You can use a bonus action to mentally command the creatures you make with this spell, issuing the same command to all of them. To receive the command, a creature must be within 60 feet of you. You decide what action the creatures will take and where they will move during their next turn, or you can issue a general command, such as to guard a chamber or passageway against your foes. If you issue no commands, the creatures do nothing except defend themselves against hostile creatures. Once given an order, the creatures continue to follow it until their task is complete."}, {"class": "warlock", "name": "Dream", "source": "Player's Handbook", "level": 5, "casting": "1 minute", "range": "Special", "components": "V, S, M (a handful of sand, a dab of ink, and a writing quill plucked from a sleeping bird)", "duration": "8 hours", "description": "This spell shapes a creature’s dreams. Choose a creature known to you as the target of this spell. The target must be on the same plane of existence as you. Creatures that don’t sleep, such as elves, can’t be contacted by this spell. You, or a willing creature you touch, enters a trance state, acting as a messenger. While in the trance, the messenger is aware of their surroundings, but can’t take actions or move."}, {"class": "warlock", "name": "Enervation", "source": "Xanathar's Guide to Everything", "level": 5, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "A tendril of inky darkness reaches out from you, touching a creature you can see within range to drain life from it. The target must make a Dexterity saving throw. On a successful save, the target takes 2d8 necrotic damage, and the spell ends. On a failed save, the target takes 4d8 necrotic damage, and until the spell ends, you can use your action on each of your turns to automatically deal 4d8 necrotic damage to the target. The spell ends if you use your action to do anything else, if the target is ever outside the spell’s range, or if the target has total cover from you. Whenever the spell deals damage to a target, you regain hit points equal to half the amount of necrotic damage the target takes."}, {"class": "warlock", "name": "Far Step", "source": "Xanathar's Guide to Everything", "level": 5, "casting": "1 bonus action", "range": "Self", "components": "V", "duration": "Concentration, up to 1 minute", "description": "You teleport up to 60 feet to an unoccupied space you can see. On each of your turns before the spell ends, you can use a bonus action to teleport in this way again."}, {"class": "warlock", "name": "Hold Monster", "source": "Player's Handbook", "level": 5, "casting": "1 action", "range": "90 feet", "components": "V, S, M (a small, straight piece of iron)", "duration": "Concentration, up to 1 minute", "description": "Choose a creature that you can see within range. The target must succeed on a Wisdom saving throw or be paralyzed for the duration. This spell has no effect on undead. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the spell ends on the target."}, {"class": "warlock", "name": "Infernal Calling", "source": "Xanathar's Guide to Everything", "level": 5, "casting": "1 minute", "range": "90 feet", "components": "V, S, M (a ruby worth at least 999 gp)", "duration": "Concentration, up to 1 hour", "description": "Uttering a dark incantation, you summon a devil from the Nine Hells. You choose the devil’s type, which must be one of challenge rating 6 or lower, such as a barbed devil or a bearded devil. The devil appears in an unoccupied space that you can see within range. The devil disappears when it drops to 0 hit points or when the spell ends."}, {"class": "warlock", "name": "Mislead", "source": "Player's Handbook", "level": 5, "casting": "1 action", "range": "Self", "components": "S", "duration": "Concentration, up to 1 hour", "description": "You become invisible at the same time that an illusory double of you appears where you are standing. The double lasts for the duration, but the invisibility ends if you attack or cast a spell."}, {"class": "warlock", "name": "Negative Energy Flood", "source": "Xanathar's Guide to Everything", "level": 5, "casting": "1 action", "range": "60 feet", "components": "V, M (a broken bone and a square of black silk)", "duration": "Instantaneous", "description": "You send ribbons of negative energy at one creature you can see within range. Unless the target is undead, it must make a Constitution saving throw, taking 5d12 necrotic damage on a failed save, or half as much damage on a successful one. A target killed by this damage rises up as a zombie at the start of your next turn. The zombie pursues whatever creature it can see that is closest to it. Statistics for the zombie are in the Monster Manual. If you target an undead with this spell, the target doesn’t make a saving throw. Instead, roll 5d12. The target gains half the total as temporary hit points."}, {"class": "warlock", "name": "Planar Binding", "source": "Player's Handbook", "level": 5, "casting": "1 hour", "range": "60 feet", "components": "V, S, M (a jewel worth at least 1,000 gp, which the spell consumes)", "duration": "24 hours", "description": "With this spell, you attempt to bind a celestial, an elemental, a fey, or a fiend to your service. The creature must be within range for the entire casting of the spell. (Typically, the creature is first summoned into the center of an inverted Magic Circle in order to keep it trapped while this spell is cast.) At the completion of the casting, the target must make a Charisma saving throw. On a failed save, it is bound to serve you for the duration. If the creature was summoned or created by another spell, that spell’s duration is extended to match the duration of this spell."}, {"class": "warlock", "name": "Scrying", "source": "Player's Handbook", "level": 5, "casting": "10 minutes", "range": "Self", "components": "V, S, M (a focus worth at least 1,000 gp, such as a crystal ball, a silver mirror, or a font filled with holy water)", "duration": "Concentration, up to 10 minutes", "description": "You can see and hear a particular creature you choose that is on the same plane of existence as you. The target must make a Wisdom saving throw, which is modified by how well you know the target and the sort of physical connection you have to it. If a target knows you’re casting this spell, it can fail the saving throw voluntarily if it wants to be observed."}, {"class": "warlock", "name": "Synaptic Static", "source": "Xanathar's Guide to Everything", "level": 5, "casting": "1 action", "range": "120 feet", "components": "V, S", "duration": "Instantaneous", "description": "You choose a point within range and cause psychic energy to explode there. Each creature in a 20-foot-radius sphere centered on that point must make an Intelligence saving throw. A creature with an Intelligence score of 2 or lower can’t be affected by this spell. A target takes 8d6 psychic damage on a failed save, or half as much damage on a successful one."}, {"class": "warlock", "name": "Teleportation Circle", "source": "Player's Handbook", "level": 5, "casting": "1 minute", "range": "10 feet", "components": "V, M (rare chalks and inks infused with precious gems worth 50 gp, which the spell consumes)", "duration": "1 round", "description": "As you cast the spell, you draw a 10-foot-diameter circle on the ground inscribed with sigils that link your location to a permanent teleportation circle of your choice whose sigil sequence you know and that is on the same plane of existence as you."}, {"class": "warlock", "name": "Wall of Light", "source": "Xanathar's Guide to Everything", "level": 5, "casting": "1 action", "range": "120 feet", "components": "V, S, M (a hand mirror)", "duration": "Concentration, up to 10 minutes", "description": "A shimmering wall of bright light appears at a point you choose within range. The wall appears in any orientation you choose: horizontally, vertically, or diagonally. It can be free floating, or it can rest on a solid surface. The wall can be up to 60 feet long, 10 feet high, and 5 feet thick. The wall blocks line of sight, but creatures and objects can pass through it. It emits bright light out to 120 feet and dim light for an additional 120 feet."}, {"class": "warlock", "name": "Arcane Gate", "source": "Player's Handbook", "level": 6, "casting": "1 action", "range": "500 feet", "components": "V, S", "duration": "Concentration, up to 10 minutes", "description": "You create linked teleportation portals that remain open for the duration. Choose two points on the ground that you can see, one point within 10 feet of you and one point within 500 feet of you. A circular portal, 10 feet in diameter, opens over each point. If the portal would open in the space occupied by a creature, the spell fails, and the casting is lost."}, {"class": "warlock", "name": "Circle of Death", "source": "Player's Handbook", "level": 6, "casting": "1 action", "range": "150 feet", "components": "V, S, M (the powder of a crushed black pearl worth at least 500 gp)", "duration": "Instantaneous", "description": "A sphere of negative energy ripples out in a 60-foot-radius sphere from a point within range. Each creature in that area must make a Constitution saving throw. A target takes 8d6 necrotic damage on a failed save, or half as much damage on a successful one."}, {"class": "warlock", "name": "Conjure Fey", "source": "Player's Handbook", "level": 6, "casting": "1 action", "range": "90 feet", "components": "V, S", "duration": "Concentration, up to 1 hour", "description": "You summon a fey creature of challenge rating 6 or lower, or a fey spirit that takes the form of a beast of challenge rating 6 or lower. It appears in an unoccupied space that you can see within range. The fey creature disappears when it drops to 0 hit points or when the spell ends."}, {"class": "warlock", "name": "Create Undead", "source": "Player's Handbook", "level": 6, "casting": "1 minute", "range": "10 feet", "components": "V, S, M (one clay pot filled with grave dirt, one clay pot filled with brackish water, and one 150 gp black onyx stone for each corpse)", "duration": "Instantaneous", "description": "You can cast this spell only at night. Choose up to three corpses of Medium or Small humanoids within range. Each corpse becomes a ghoul under your control. The DM has game statistics for these creatures."}, {"class": "warlock", "name": "Eyebite", "source": "Player's Handbook", "level": 6, "casting": "1 action", "range": "Self", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "For the spell’s duration, your eyes become an inky void imbued with dread power. One creature of your choice within 60 feet of you that you can see must succeed on a Wisdom saving throw or be affected by one of the following effects of your choice for the duration. On each of your turns until the spell ends, you can use your action to target another creature but can’t target a creature again if it has succeeded on a saving throw against this casting of eyebite."}, {"class": "warlock", "name": "Flesh to Stone", "source": "Player's Handbook", "level": 6, "casting": "1 action", "range": "60 feet", "components": "V, S, M (a pinch of lime, water, and earth)", "duration": "Concentration, up to 1 minute", "description": "You attempt to turn one creature that you can see within range into stone. If the target's body is made of flesh, the creature must make a Constitution saving throw. On a failed save, it is restrained as its flesh begins to harden. On a successful save, the creature isn’t affected."}, {"class": "warlock", "name": "Investiture of Flame", "source": "Xanathar's Guide to Everything", "level": 6, "casting": "1 action", "range": "Self", "components": "V, S", "duration": "Concentration, up to 10 minutes", "description": "Flames race across your body, shedding bright light in a 30-foot radius and dim light for an additional 30 feet for the spell’s duration. The flames don’t harm you. Until the spell ends, you gain the following benefits:"}, {"class": "warlock", "name": "Investiture of Ice", "source": "Xanathar's Guide to Everything", "level": 6, "casting": "1 action", "range": "Self", "components": "V, S", "duration": "Concentration, up to 10 minutes", "description": "Until the spell ends, ice rimes your body, and you gain the following benefits:"}, {"class": "warlock", "name": "Investiture of Stone", "source": "Xanathar's Guide to Everything", "level": 6, "casting": "1 action", "range": "Self", "components": "V, S", "duration": "Concentration, up to 10 minutes", "description": "Until the spell ends, bits of rock spread across your body, and you gain the following benefits:"}, {"class": "warlock", "name": "Investiture of Wind", "source": "Xanathar's Guide to Everything", "level": 6, "casting": "1 action", "range": "Self", "components": "V, S", "duration": "Concentration, up to 10 minutes", "description": "Until the spell ends, wind whirls around you, and you gain the following benefits:"}, {"class": "warlock", "name": "Mass Suggestion", "source": "Player's Handbook", "level": 6, "casting": "1 action", "range": "60 feet", "components": "V, M (a snake’s tongue and either a bit of honeycomb or a drop of sweet oil)", "duration": "24 hours", "description": "You suggest a course of activity (limited to a sentence or two) and magically influence up to twelve creatures of your choice that you can see within range and that can hear and understand you. Creatures that can’t be charmed are immune to this effect. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to stab itself, throw itself onto a spear, immolate itself, or do some other obviously harmful act automatically negates the effect of the spell."}, {"class": "warlock", "name": "Mental Prison", "source": "Xanathar's Guide to Everything", "level": 6, "casting": "1 action", "range": "60 feet", "components": "S", "duration": "Concentration, up to 1 minute", "description": "You attempt to bind a creature within an illusory cell that only it perceives. One creature you can see within range must make an Intelligence saving throw. The target succeeds automatically if it is immune to being charmed. On a successful save, the target takes 5d10 psychic damage, and the spell ends. On a failed save, the target takes 5d10 psychic damage, and you make the area immediately around the target’s space appear dangerous to it in some way. You might cause the target to perceive itself as being surrounded by fire, floating razors, or hideous maws filled with dripping teeth. Whatever form the illusion takes, the target can’t see or hear anything beyond it and is restrained for the spell’s duration. If the target is moved out of the illusion, makes a melee attack through it, or reaches any part of its body through it, the target takes 10d10 psychic damage, and the spell ends."}, {"class": "warlock", "name": "Scatter", "source": "Xanathar's Guide to Everything", "level": 6, "casting": "1 action", "range": "30 feet", "components": "V", "duration": "Instantaneous", "description": "The air quivers around up to five creatures of your choice that you can see within range. An unwilling creature must succeed on a Wisdom saving throw to resist this spell. You teleport each affected target to an unoccupied space that you can see within 120 feet of you. That space must be on the ground or on a floor."}, {"class": "warlock", "name": "Soul Cage", "source": "Xanathar's Guide to Everything", "level": 6, "casting": "1 reaction, which you take when a humanoid you can see within 60 feet of you dies", "range": "60 feet", "components": "V, S, M (a tiny silver cage worth 100 gp)", "duration": "8 hours", "description": "This spell snatches the soul of a humanoid as it dies and traps it inside the tiny cage you use for the material component. A stolen soul remains inside the cage until the spell ends or until you destroy the cage, which ends the spell. While you have a soul inside the cage, you can exploit it in any of the ways described below. You can use a trapped soul up to six times. Once you exploit a soul for the sixth time, it is released, and the spell ends. While a soul is trapped, the dead humanoid it came from can’t be revived."}, {"class": "warlock", "name": "Summon Fiend", "source": "Tasha's Cauldron of Everything", "level": 6, "casting": "1 action", "range": "90 feet", "components": "V, S, M (humanoid blood inside a ruby vial worth at least 600 gp)", "duration": "Concentration, up to 1 hour", "description": "You call forth a fiendish spirit. It manifests in an unoccupied space that you can see within range. This corporeal form uses the Fiendish Spirit stat block. When you cast the spell, choose Demon, Devil, or Yugoloth. The creature resembles a fiend of the chosen type, which determines certain traits in its stat block. The creature disappears when it drops to 0 hit points or when the spell ends."}, {"class": "warlock", "name": "Tasha's Otherworldly Guise", "source": "Tasha's Cauldron of Everything", "level": 6, "casting": "1 bonus action", "range": "Self", "components": "V, S, M (an object engraved with a symbol of the Outer Planes, worth at least 500 gp)", "duration": "Concentration, up to 1 minute", "description": "Uttering an incantation, you draw on the magic of the Lower Planes or Upper Planes (your choice) to transform yourself. You gain the following benefits until the spell ends:"}, {"class": "warlock", "name": "True Seeing", "source": "Player's Handbook", "level": 6, "casting": "1 action", "range": "Touch", "components": "V, S, M (an ointment for the eyes that costs 25 gp; is made from mushroom powder, saffron, and fat; and is consumed by the spell)", "duration": "1 hour", "description": "This spell gives the willing creature you touch the ability to see things as they actually are. For the duration, the creature has truesight, notices secret doors hidden by magic, and can see into the Ethereal Plane, all out to a range of 120 feet."}, {"class": "warlock", "name": "Crown of Stars", "source": "Xanathar's Guide to Everything", "level": 7, "casting": "1 action", "range": "Self", "components": "V, S", "duration": "1 hour", "description": "Seven star-like motes of light appear and orbit your head until the spell ends. You can use a bonus action to send one of the motes streaking toward one creature or object within 120 feet of you. When you do so, make a ranged spell attack. On a hit, the target takes 4d12 radiant damage. Whether you hit or miss, the mote is expended. The spell ends early if you expend the last mote. If you have four or more motes remaining, they shed bright light in a 30-foot radius and dim light for an additional 30 feet. If you have one to three motes remaining, they shed dim light in a 30-foot radius."}, {"class": "warlock", "name": "Dream of the Blue Veil", "source": "Tasha's Cauldron of Everything", "level": 7, "casting": "10 minutes", "range": "20 feet", "components": "V, S, M (a magic item or a willing creature from the destination world)", "duration": "6 hours", "description": "You and up to eight willing creatures within range fall unconscious for the spells’ duration and experience visions of another world on the Material Plane, such as Oerth, Toril, Krynn, or Eberron. If the spell reaches its full duration, the visions conclude with each of you encountering and pulling back a mysterious blue curtain. The spell then ends with you mentally and physically transported to the world that was in the visions."}, {"class": "warlock", "name": "Etherealness", "source": "Player's Handbook", "level": 7, "casting": "1 action", "range": "Self", "components": "V, S", "duration": "Up to 8 hours", "description": "You step into the border regions of the Ethereal Plane, in the area where it overlaps with your current plane. You remain in the Border Ethereal for the duration or until you use your action to dismiss the spell. During this time, you can move in any direction. If you move up or down, every foot of movement costs an extra foot. You can see and hear the plane you originated from, but everything there looks gray, and you can’t see anything more than 60 feet away."}, {"class": "warlock", "name": "Finger of Death", "source": "Player's Handbook", "level": 7, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "Instantaneous", "description": "You send negative energy coursing through a creature that you can see within range, causing it searing pain. The target must make a Constitution saving throw. It takes 7d8 + 30 necrotic damage on a failed save, or half as much damage on a successful one."}, {"class": "warlock", "name": "Forcecage", "source": "Player's Handbook", "level": 7, "casting": "1 action", "range": "100 feet", "components": "V, S, M (ruby dust worth 1,500 gp)", "duration": "1 hour", "description": "An immobile, invisible, cube-shaped prison composed of magical force springs into existence around an area you choose within range. The prison can be a cage or a solid box as you choose."}, {"class": "warlock", "name": "Plane Shift", "source": "Player's Handbook", "level": 7, "casting": "1 action", "range": "Touch", "components": "V, S, M (a forked, metal rod worth at least 250 gp, attuned to a particular plane of existence)", "duration": "Instantaneous", "description": "You and up to eight willing creatures who link hands in a circle are transported to a different plane of existence. You can specify a target destination in general terms, such as the City of Brass on the Elemental Plane of Fire or the palace of Dispater on the second level of the Nine Hells, and you appear in or near that destination. If you are trying to reach the City of Brass, for example, you might arrive in its Street of Steel, before its Gate of Ashes, or looking at the city from across the Sea of Fire, at the DM’s discretion."}, {"class": "warlock", "name": "Power Word: Pain", "source": "Xanathar's Guide to Everything", "level": 7, "casting": "1 action", "range": "60 feet", "components": "V", "duration": "Instantaneous", "description": "You speak a word of power that causes waves of intense pain to assail one creature you can see within range. If the target has 100 hit points or fewer, it is subject to crippling pain. Otherwise, the spell has no effect on it. A target is also unaffected if it is immune to being charmed."}, {"class": "warlock", "name": "Demiplane", "source": "Player's Handbook", "level": 8, "casting": "1 action", "range": "60 feet", "components": "S", "duration": "1 hour", "description": "You create a shadowy door on a flat solid surface that you can see within range. The door is large enough to allow Medium creatures to pass through unhindered. When opened, the door leads to a demiplane that appears to be an empty room 30 feet in each dimension, made of wood or stone. When the spell ends, the door disappears, and any creatures or objects inside the demiplane remain trapped there, as the door also disappears from the other side."}, {"class": "warlock", "name": "Dominate Monster", "source": "Player's Handbook", "level": 8, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "Concentration, up to 1 hour", "description": "You attempt to beguile a creature that you can see within range. It must succeed on a Wisdom saving throw or be charmed by you for the duration. If you or creatures that are friendly to you are fighting it, it has advantage on the saving throw."}, {"class": "warlock", "name": "Feeblemind", "source": "Player's Handbook", "level": 8, "casting": "1 action", "range": "150 feet", "components": "V, S, M (a handful of clay, crystal, glass, or mineral spheres)", "duration": "Instantaneous", "description": "You blast the mind of a creature that you can see within range, attempting to shatter its intellect and personality. The target takes 4d6 psychic damage and must make an Intelligence saving throw."}, {"class": "warlock", "name": "Glibness", "source": "Player's Handbook", "level": 8, "casting": "1 action", "range": "Self", "components": "V", "duration": "1 hour", "description": "Until the spell ends, when you make a Charisma check, you can replace the number you roll with a 15. Additionally, no matter what you say, magic that would determine if you are telling the truth indicates that you are being truthful."}, {"class": "warlock", "name": "Maddening Darkness", "source": "Xanathar's Guide to Everything", "level": 8, "casting": "1 action", "range": "150 feet", "components": "V, M (a drop of pitch mixed with a drop of mercury)", "duration": "Concentration, up to 10 minutes", "description": "Magical darkness spreads from a point you choose within range to fill a 60-foot-radius sphere until the spell ends. The darkness spreads around corners. A creature with darkvision can’t see through this darkness. Nonmagical light, as well as light created by spells of 8th level or lower, can't illuminate the area. Shrieks, gibbering, and mad laughter can be heard within the sphere. Whenever a creature starts its turn in the sphere, it must make a Wisdom saving throw, taking 8d8 psychic damage on a failed save, or half as much damage on a successful one."}, {"class": "warlock", "name": "Power Word: Stun", "source": "Player's Handbook", "level": 8, "casting": "1 action", "range": "60 feet", "components": "V, S", "duration": "Instantaneous", "description": "You speak a word of power that can overwhelm the mind of one creature you can see within range, leaving it dumbfounded. If the target has 150 hit points or fewer, it is stunned. Otherwise, the spell has no effect. The stunned target must make a Constitution saving throw at the end of each of its turns. On a successful save, this stunning effect ends."}, {"class": "warlock", "name": "Astral Projection", "source": "Player's Handbook", "level": 9, "casting": "1 hour", "range": "10 feet", "components": "V, S, M (for each creature you affect with this spell, you must provide one jacinth worth at least 1,000 gp and one ornately carved bar of silver worth at least 100 gp, all of which the spell consumes)", "duration": "Special", "description": "You and up to eight willing creatures within range project your astral bodies into the Astral Plane (the spell fails and the casting is wasted if you are already on that plane). The material body you leave behind is unconscious and in a state of suspended animation; it doesn’t need food or air and doesn’t age."}, {"class": "warlock", "name": "Blade of Disaster", "source": "Tasha's Cauldron of Everything", "level": 9, "casting": "1 bonus action", "range": "60 feet", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "You create a blade-shaped planar rift about 3 feet long in an unoccupied space you can see within range. The blade lasts for the duration. When you cast this spell, you can make up to two melee spell attacks with the blade, each one against a creature, loose object, or structure within 5 feet of the blade. On a hit, the target takes 4d12 force damage. This attack scores a critical hit if the number on the d20 is 18 or higher. On a critical hit, the blade deals an extra 8d12 force damage (for a total of 12d12 force damage)."}, {"class": "warlock", "name": "Foresight", "source": "Player's Handbook", "level": 9, "casting": "1 minute", "range": "Touch", "components": "V, S, M (a hummingbird feather)", "duration": "8 hours", "description": "You touch a willing creature and bestow a limited ability to see into the immediate future. For the duration, the target can’t be surprised and has advantage on attack rolls, ability checks, and saving throws. Additionally, other creatures have disadvantage on attack rolls against the target for the duration. This spell immediately ends if you cast it again before its duration ends."}, {"class": "warlock", "name": "Imprisonment", "source": "Player's Handbook", "level": 9, "casting": "1 minute", "range": "30 feet", "components": "V, S, M (a vellum depiction or a carved statuette in the likeness of the target, and a special component that varies according to the version of the spell you choose, worth at least 500 gp per Hit Die of the target)", "duration": "Until dispelled", "description": "You create a magical restraint to hold a creature that you can see within range. The target must succeed on a Wisdom saving throw or be bound by the spell; if it succeeds, it is immune to this spell if you cast it again. While affected by this spell, the creature doesn't need to breathe, eat, or drink, and it doesn’t age. Divination spells can’t locate or perceive the target."}, {"class": "warlock", "name": "Power Word: Kill", "source": "Player's Handbook", "level": 9, "casting": "1 action", "range": "60 feet", "components": "V", "duration": "Instantaneous", "description": "You utter a word of power that can compel one creature you can see within range to die instantly. If the creature you chose has 100 hit points or fewer, it dies. Otherwise, the spell has no effect."}, {"class": "warlock", "name": "Psychic Scream", "source": "Xanathar's Guide to Everything", "level": 9, "casting": "1 action", "range": "90 feet", "components": "S", "duration": "Instantaneous", "description": "You unleash the power of your mind to blast the intellect of up to ten creatures of your choice that you can see within range. Creatures that have an Intelligence score of 2 or lower are unaffected.\nEach target must make an Intelligence saving throw. On a failed save, a target takes 14d6 psychic damage and is stunned. On a successful save, a target takes half as much damage and isn’t stunned. If a target is killed by this damage, its head explodes, assuming it has one."}, {"class": "warlock", "name": "Shapechange", "source": "Player's Handbook", "level": 9, "casting": "1 action", "range": "Self", "components": "V, S, M (a jade circlet worth at least 1,500 gp, which you must place on your head before you cast the spell)", "duration": "Concentration, up to 1 hour", "description": "You assume the form of a different creature for the duration. The new form can be any creature with a challenge rating equal to your level or lower. The creature can't be a construct or an undead, and you must have seen the sort of creature at least once. You transform into an average example of that creature, one without any class levels or the Spellcasting trait."}, {"class": "warlock", "name": "True Polymorph", "source": "Player's Handbook", "level": 9, "casting": "1 action", "range": "30 feet", "components": "V, S, M (a drop of mercury, a dollop of gum arabic, and a wisp of smoke)", "duration": "Concentration, up to 1 hour", "description": "Choose one creature or nonmagical object that you can see within range. You transform the creature into a different creature, the creature into a nonmagical object, or the object into a creature (the object must be neither worn nor carried by another creature). The transformation lasts for the duration, or until the target drops to 0 hit points or dies. If you concentrate on this spell for the full duration, the transformation becomes permanent."}, {"class": "warlock", "name": "Weird", "source": "Player's Handbook", "level": 9, "casting": "1 action", "range": "120 feet", "components": "V, S", "duration": "Concentration, up to 1 minute", "description": "Drawing on the deepest fears of a group of creatures, you create illusory creatures in their minds, visible only to them."}]